[
{
    "article_url": "https://www.businesstoday.in/rssfeeds/?id=home",
    "title": "D-street ended in green for third straight week amid concerns over slow monsoon; What lies ahead?",
    "published_date": "2024-06-22",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": ""
},
{
    "article_url": "https://www.businesstoday.in/markets/global-markets/story/hindalco-industries-arm-novelis-inc-files-documents-with-sec-for-proposed-us-ipo-418270-2024-02-20",
    "title": "Hindalco Industries' arm Novelis Inc files documents with SEC for proposed US IPO - BusinessToday",
    "published_date": "2024-02-20",
    "author_name": "Business Today Desk",
    "author_url": "https://www.businesstoday.in/author/business-today-desk",
    "article_content": "Feedback Novelis, the wholly-owned arm of Hindalco Industries, on Tuesday said it has submitted a draft registration statement with the US Securities and Exchange Commission (SEC) for its proposed initial public offering. The common shares are expected to be offered by Novelis' sole shareholder--a wholly-owned subsidiary of Hindalco Industries Ltd . \"Novelis Inc, a leading sustainable aluminum solutions provider and the world leader in aluminum rolling and recycling, today announced that it has confidentially submitted a draft registration statement on Form F-1 with the Securities and Exchange Commission (the SEC) relating to the proposed initial public offering of its common shares,\" it said in a statement. Novelis will not receive any proceeds from the share sale. Novelis expects to complete the public offering after the SEC completes its review process, subject to market and other conditions. Novelis is a subsidiary of Hindalco Industries Ltd, an industry leader in aluminum, copper and metals; and a flagship company of the Aditya Birla Group. Novelis is a leading sustainable aluminum solutions provider and is into aluminum rolling and recycling. Novelis operates an integrated network of technically advanced rolling and recycling facilities across North America, South America, Europe and Asia. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/tools-and-calculators/latte-factor-calculator",
    "title": "Latte Factor Calculator: Transforming Small Savings into Big Wins!",
    "published_date": "01 Jan 1970",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback The Latte Factor calculator estimates the opportunity cost of petty expenses incurred over a period of time. The term ‘Latte Factor’ was coined by American financial author, David Bach. Bach suggested jettisoning recurrent small expenses and investing the money instead. Unfettered indulgence in binge spending has ramifications on long term wealth. The BT Latte Factor calculator helps estimate earnings if money is spent on SIP instead of trivial expenses. The calculation is based on inputs viz, expenditure, duration of expense (years), frequency of expense and annual return forgone. Annual return forgone is the return that you have forgone by indulging in spending rather than investing. The Latte Factor calculator uses 4 inputs viz, amount of expense, duration of expense, expense frequency and annual returns forgone by not investing. It measures the opportunity cost of expenses on trivial purchases. For calculating the return on SIP investments, the calculator uses the formula P [(1+i) ^n-1] x (1+i)/i Total expenditure incurred = Amount (daily*30/weekly*4/monthly*1) * 12 * Duration of expenditure (years) Assume you spend Rs 50 each day for 5 years. Thus, monthly spending is Rs 50*30 = Rs 1,500. In 5 years, the total expense made is Rs 90,000 (50*30*12*5). Assuming an expected annual return of 12%, had you invested Rs 1,500 through monthly SIP, you would have earned almost Rs 1.24 lakhs. The Latte Factor calculator allows you to recalibrate the inputs in order to provide a precise estimation of the output. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/bt-tv/easynomics/video/how-business-family-spats-affect-minority-shareholders-424363-2024-04-04",
    "title": "How Business Family Spats Affect Minority Shareholders? - Easynomics BusinessToday",
    "published_date": "2024-04-04",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback Family disputes within business conglomerates often have far-reaching consequences, impacting not only the feuding parties but also minority shareholders. These shareholders, who hold stakes in listed entities, bear the brunt of such conflicts. Their interests can be compromised due to power struggles, lack of transparency, and poor succession planning. Watch Siddharth Zarabi, Managing Editor, Business Today TV in conversation with Sakate Khaitan, Senior Partner, Khaitan Legal Associates, Srinath Sridharan, Corporate Advisor & Policy Researcher and Shriram Subramanian, Founder & MD, InGovern Research Services. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/issue/2024-06-09",
    "title": "Amazon's India Master Plan",
    "published_date": "2024-06-09",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Breaking the chains: Is India ready to challenge Google and Apple's app store duopoly? India's Digital Competition Bill is pitting consumer protection against market reforms; here's how Here's why the Indian Railways' dedicated freight corridors could prove to be a game changer Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/userfeedback?ref=tools-and-calculators%2Fsip-calculator&feedbackto=&siteId=1&type=feedback",
    "title": "User Feedback",
    "published_date": "01 Jan 1970",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/india/story/open-to-probe-by-jpc-or-sebi-axis-my-indias-pradeep-gupta-on-exit-poll-scam-charge-434328-2024-06-22",
    "title": "'Open to probe by JPC or Sebi': Axis My India's Pradeep Gupta on 'exit poll scam' charge - BusinessToday",
    "published_date": "2024-06-22",
    "author_name": "Business Today Desk",
    "author_url": "https://www.businesstoday.in/author/business-today-desk",
    "article_content": "Feedback Amid accusations of using exit polls for stock market manipulation, Axis My India's chief Pradeep Gupta said he is open to facing all kinds of investigations and it would help do business in a much better way if the government frames specific regulations for pollsters. Opposition parties and several civil society groups have been asking for thorough investigations, including by capital markets regulator SEBI and a Joint Parliamentary Committee (JPC), after the stock markets witnessed a massive rally when exit polls gave a huge majority to the BJP but fell sharply after the actual results showed the ruling party falling short of a clear majority on its own. Gupta, in a interaction with an agency, termed as \"childish\" the demands for banning exit polls, saying every single citizen and organisation wants to know the election results and banning exit polls would serve no purpose. Gupta had predicted 361-401 seats for the BJP-led alliance as against the actual tally of 240 seats. \"We have no connection with stock market whatsoever but I am happy to know these allegations because our data and system is so foolproof that any probe will give me an opportunity to showcase all of that is used to predict exit polls to the world. In a way it is an opportunity for us, I support the demand as it will give us a chance to show our credentials,\" he said. Asked about whether he is open to a probe by a JPC or SEBI, the pollster said, \"I am open to facing all kind of investigations\". \"As far as me deriving any benefit from stock market jump is concerned...Axis My India has no demat account. It is a limited company, not listed and till today not a single external investment is there in the company. There is no investment by promoters. My personal investment in stocks since April has been merely Rs 35,000. Where have I benefited?\" he asserted. The pollster also responded to allegations of Axis My India also conducting exit polls for foreign investors and sharing different results with them. \"We have never been approached by any FII, neither we have worked for any foreign investors, we have not conducted any exit poll survey for them ever,\" Gupta, 55, said. He also said Axis My India's 70 per cent clients are corporate clients including bigwigs like Bill Melinda Gates foundation and denied any conflict of interest with exit polls. Questioned about whether the dent in image caused by 2024 poll results has also impacted his corporate clients, Gupta said, \"They give us business for the work we do for them and not on basis of how rightly we predict election results\". \"Since the last five years, I am running from pillar to post seeking some regulations. When our people go on ground, they are seen with a suspicious mindset. We have to convince that we are not salespersons, we aren't frauds and we are not sent by a political party. We are often asked who gave you permission? And we ask please tell where we need to take permission? \"We wrote to the home ministry, we were guided to the law ministry that there is no law so first we need a law. From there we were referred to the information and broadcasting ministry that you get yourself registered there and set up a cell. We were told that you will publish a survey but who will monitor who is right and wrong ... nothing has moved but I strongly believe that we need regulations,\" he said. Axis My India has been conducting exit polls since 2013 after Gupta returned from the Harvard Business School and claims a track record of predicting 61 out of 65 elections correctly. Asked about why does Axis My India does not make a disclosure that some political parties are also its clients, Gupta said, \"In the 2019 Haryana assembly elections, BJP was one of our clients and in exit polls we predicted a hung assembly, which was bang on\". \"The prediction is even part of a Harvard Business School case study and includes a disclosure. Wherever, the client agrees we make a disclosure, there is nothing to hide,\" Gupta added. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/education/story/bihar-tet-2024-exam-suspended-due-to-unavoidable-circumstances-new-date-to-be-announced-soon-434308-2024-06-22",
    "title": "Bihar TET 2024 exam suspended due to ‘unavoidable circumstances’, new date to be announced soon - BusinessToday",
    "published_date": "2024-06-22",
    "author_name": "Business Today Desk",
    "author_url": "https://www.businesstoday.in/author/business-today-desk",
    "article_content": "Feedback The Bihar School Examination Board has postponed the Teacher Eligibility Test (TET), which was scheduled to be held between June 26 and 28 due to ‘unavoidable circumstances’. In a notification, the board said that a new date for the examination will be announced soon. The employed teachers are given the status of state employees only when they pass the Teacher Eligibility Test. TET is to be conducted for teacher candidates of primary school, secondary school and higher secondary school in Bihar. The postponement of the exam comes against the backdrop of paper leaks UGC-NET and NEET-UG exams. Union Education Minister Dharmendra Pradhan on June 20 said that UGC-NET exam was cancelled after it was found that the question paper was leaked on darknet. The CSIR-UGC-NET exam, which was to be conducted between June 25 and June 27, was also postponed by the NTA in a notification on June 21 due to ‘unavoidable circumstances’. The NTA conducted the UGC-NET June 2024 Examination in OMR (pen and paper) mode on June 18 across 1,205 exam centres in 317 cities. Nearly 10 lakh candidates appeared for the exam, which is held for Assistant Professor posts in universities and colleges and to determine eligibility for junior research fellowships. Meanwhile, The National Testing Agency (NTA) has released admit cards for re-examination for 1,563 candidates for National Eligibility cum Entrance Test (NEET-UG), which will be held on June 23. Officials said that NEET-UG re-examinations will be conducted for 1,563 candidates, who were earlier given grace marks as compensation due to lost time during the examination held on May 5. Officials from the National Testing Agency (NTA) and the Union education ministry will be present at the examination centres. Officials said that six new centres have been issued to students this time. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/specials/indias-best-banks-2019/story/tech-powering-finance-289905-2021-03-03",
    "title": "Tech Powering Finance - BusinessToday - Issue Date: Mar 21, 2021",
    "published_date": "Mar 21, 2021",
    "author_name": "Rukmini Rao",
    "author_url": "Rukmini Rao",
    "article_content": "Feedback For serial entrepreneur Bhavin Turakhia, the vision while setting up Zeta was very clear. \"We started with the notional objective of being a globally disruptive and dominant player in three buckets, with focus on banking, payments and commerce. Our goal is to provide the most-outstanding experience from a banking and payments standpoint and create unique experiences for commerce - buying/selling goods for customers, merchants, companies, employees and banks,\" says Turakhia. Co- founders Turakhia and Ramakrishna Gaddipati started their Fintech journey with 'Zeta Tax Benefits' in 2016, a Cloud-based enterprise benefits suite, which digitises meal vouchers, fuel and communications cards, medical reimbursements, gadget cards, gift cards and LTA cards. There was also Zeta Express for cashless transactions at corporate cafeterias, for which the company initially roped in Sodexo, RBL Bank, IDFC Bank, Kotak Mahindra Bank, ADP India and Excelity Global. \"While the solution that we first started out with was employee benefits, we were eventually building a full-stack banking solution,\" says Bhavin. While charting out Zeta's path, the founders were staring at two options - either to get into the neo-banking/lending space, or become a pure-play Fintech. However, the challenges of regulation and capital- intensive nature in case of banks, and the risk of vertical integration and middle layers in case of Fintechs, led Turakhia and Gaddipati to look into the problem-solving area in both spaces. \"If you talk to any bank today, not a single bank will tell you they love their technology,\" says Turakhia. \"With many of them having worked with 20- 30 different vendors, from big companies to small players, banks know they are running on old technologies that cannot adapt to the latest trends or changing technology. We felt that is a clear problem to solve and we can basically become a dominant player in that space.\" The company currently has three distinct platforms - Tachyon, Fusion and Electron - offering solutions. Tachyon is a Cloud-based full stack, API-ready neo-banking solutions platform with a card management system, which can host credit, debit and prepaid cards and is capable of supporting use-cases for both physical and virtual cards. The payment engine enables just-in-time payments with transactions funded from multiple accounts. For instance, a payment can be funded first from a credit card account and any shortfall in funds can be covered from the savings or prepaid account, which is enabled with multiple payment methods such as account transfers, UPI, card payments, P2P payments, QR code payments etc. Fusion has been built for Fintech developers, for managing accounts, issuing physical, digital or tokenised cards and controlling spends on channels, levying fees or charges or interest, etc. The platform provides Fintechs with a set of Application Programming Interfaces or APIs that helps them build and solve use-cases unique to them by reducing the prototyping and go-to-market time for companies. An API is a source code-based specification used as an interface by software components to communicate with each other. One of the Fintechs that uses Fusion came up with the business idea of a start-up that gives teens access to financial literacy and digital payments through gamification, in the final year at IIT Roorkee in 2019. \"We needed a technology partner who could help us provide and scale digital payments for this vast market. We wanted to go to market fast and needed a credible, flexible and dependable technical service provider to do it with,\" says Kush Taneja, Co-founder of FamPay, a neo-bank for teenagers. A neo-bank is a kind of digital bank with no branches. Taneja recalls how they conducted their research by reaching out to other founders and Fintech product managers within their network to understand the options available and finally chose Fusion's offering. \"We charted the user journey and the Fusion team mapped APIs to wireframes. Concluding that phase, we were given sandbox and SDK (software development kit) access to integrate and test APIs. It took us six weeks for testing, which happens in a User Acceptance Testing environment wherein you can test your product with a small set of users. After User Acceptance Testing, we ran Beta testing, and then FamPay went live in four months,\" says Taneja. Zetas third offering, Electron, is a suite of solutions sold via banks to enterprises for offering employee benefit solutions and travel and management options, corporate gifting, and rewards and recognition for enterprise payments. Zeta has already signed up with seven banks and is in talks with another 11 of them for adopting Tachyon. Around 20 Fintechs have signed up for Fusion - seven of them are already live and another 11-15 are in talks with the company to integrate the programme with their apps. While Zeta plans to launch corporate gifting soon, the employee benefits product is already live in partnership with Sodexo. It has over 8,000-10,000 companies on-board, with nearly 1.5-2 million employees using it. Outside India, Zeta operates in Vietnam, The Philippines, Brazil and Italy with Electron, and plans to shortly go live in Spain and the UK. The company is also in the process of launching Tachyon and Fusion in North America. According to Turakhia, bulk of the revenues come from the Electron platform, and majority of the contracted revenue is from Tachyon. Electron benefits have already reached operational break-even, and are set to grow upwards of $20 million in annual revenues over the next five years. But both Fusion and Tachyon are catching up, \"We believe Tachyon and Fusion will operationally break-even in 2023\" he says. Bootstrapped like most of Turakhia's companies, the first external funding of around $60 million came from Sodexo in 2019 at a valuation of $300 million. Founders and employees still own around 90 per cent. \"We have cash in the bank, but we may choose to raise some additional capital. There's no urgency,\" says Turakhia. With new technology invading the financial space every day, Zeta believes it is solving one of the biggest barriers in the sector. According to Turakhia, for Fintechs to proliferate, banks have to be provided with a modern stack to help them write codes and build apps. Some of Zeta's clients have launched their businesses in less than two months with a full mobile app and financial products. With Tachyon and Fusion together, \"banks will be able to serve new-age modern digital financial services companies, and these companies in turn will be able to make a meaningful impact on the ecosystem,\" says Turakhia. @rukminirao Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/technology/news/story/healthify-vp-abhijit-khasnis-on-partnership-with-openai-and-keeping-your-health-in-check-with-tech-426743-2024-04-25",
    "title": "Healthify VP Abhijit Khasnis on partnership with OpenAI and keeping your health in check with tech - BusinessToday",
    "published_date": "2024-04-25",
    "author_name": "Pranav Dixit",
    "author_url": "https://www.businesstoday.in/author/pranav-dixit",
    "article_content": "Feedback Collaborations between industry leaders can pave the way for groundbreaking innovations. Enter Healthify, one of India's foremost health tech companies, and OpenAI, the pioneering force behind transformative AI models. At the forefront of this partnership stands Abhijit Khasnis, VP - Technology at Healthify, orchestrating the integration of OpenAI's cutting-edge GPT models into Healthify's products. The synergy between Healthify and OpenAI has not only propelled the development of innovative features but has also garnered significant recognition within the tech community. By harnessing the power of OpenAI's advancements, Healthify has introduced groundbreaking solutions such as Ria, the AI-powered wellness assistant. One notable testament to this collaboration is the recent acknowledgement from OpenAI, where Healthify was featured in a customer story on its website. This spotlight on Healthify's utilisation of Generative AI models to enhance consumer-facing products underscores the depth of the partnership and the impact it has had on advancing health technology. Moreover, OpenAI's explicit reference to Healthify's implementation of their GPT-4 Vision model in the Snap product signifies a significant milestone. As the world's first 'Fire & Forget' food recognition system, Snap automates the nutrition tracking process, showcasing the tangible benefits of integrating AI technology into healthcare solutions. The recognition not only bolsters Healthify's reputation as a leader in the field but also opens doors to new partnerships, investments, and growth opportunities. With a shared presence in India and a mutual dedication to leveraging AI for positive societal impact, the partnership between Healthify and OpenAI is hoping to redefine the future of healthcare technology. PD: What is Healthify's relationship with OpenAI? How did OpenAI give Healthify a \"shout out\"? Abhijit Khasnis: Healthify's relationship with OpenAI has allowed us to integrate their cutting-edge GPT models into our products. We have been able to get early access to the latest advancements from OpenAI to offer innovative features to our users, such as Ria, our AI-powered wellness assistant. OpenAI has acknowledged our collaboration in a couple of ways. First, they featured Healthify in a customer story on their website, which delves into our experience using Generative AI models to revamp our consumer-facing products. Most recently, when OpenAI announced the general availability of their GPT-4 Vision model, they explicitly referenced Healthify's implementation of this technology in our Snap product, the world’s first 'Fire & Forget' food recognition system that automates the nutrition tracking process, as a prime example of its capabilities. Our partnership with OpenAI is further strengthened by our shared presence in India, where OpenAI has its second-largest user base, and Healthify stands out as the country's largest health tech company. By working together, we are able to capitalise on the growing interest and expertise in generative AI, harnessing its potential to create tangible, impactful solutions for our users that ultimately lead to significant health improvements. The @healthifyme team built Snap using GPT-4 Turbo with Vision to give users nutrition insights through photo recognition of foods from around the world. pic.twitter.com/jWFLuBgEoA PD: What products or services does Healthify offer that may have caught OpenAI's attention? How is Healthify utilising or interacting with AI technology? Abhijit Khasnis: Healthify has been an AI-driven company since 2017, and we've continuously expanded upon this foundation to enhance our offerings for both coaches and users. How do we use AI? We offer advanced Gen AI solutions making us the first and only Indian company OpenAI and other big tech firms like Amazon have recognised us for our work in improving millions of lives with sustainable weight loss. Our key offerings include our conversational AI wellness coach Ria, Coach CoPilot, and Snap. With the evolution in AI models, we've swiftly implemented the latest functionalities, like function calling, JSON formatting and more. This early adoption allows our users to benefit from the newest in AI technology and address their health and wellness needs. Our partnership extends across various AI technologies, such as the Whisper model for voice processing and GPT-4 Vision for our Snap feature, enabling photo-to-food recognition. In essence, we've integrated OpenAI's technology into our application across multiple dimensions, including voice, image, and text. PD: How does the OpenAI shoutout validate or boost Healthify's work? Will it lead to new partnerships, investments, or growth opportunities? Abhijit Khasnis: OpenAI is one of the earliest and most significant AI models, often considered foundational in the field of artificial intelligence. So, being the first Indian company acknowledged by OpenAI twice in less than a month (alongside distinguished global projects like Cognition's Devin and TLDraw's Make Real) further solidifies our leadership position in the global health and fitness industry and reaffirms our commitment to leveraging cutting edge AI. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/personal-finance/tax/story/itr-filing-2024-key-changes-in-tax-return-forms-for-ay2024-25-check-details-434322-2024-06-22",
    "title": "ITR filing 2024: Key changes in tax return forms for AY2024-25. Check details - BusinessToday",
    "published_date": "2024-06-22",
    "author_name": "Business Today Desk",
    "author_url": "https://www.businesstoday.in/author/business-today-desk",
    "article_content": "Feedback ITR filing AY 2024-25: The Income Tax department time to time introduces changes in tax return forms seeking some additional details from taxpayers. Like in December 2023, the Income Tax department tweaked ITR forms 1 and 4 notified for Assessment Year 2024-25. The Central Board of Direct Taxes (CBDT) has introduced many additional reporting requirements and modifications due to the Finance Act 2023 amendments. Tax regime declaration In the revised tax return forms, a taxpayer filing ITR 1 is required to indicate his choice of tax regime in the return of income. An assessee filing ITR 4 will be required to file Form 10-IEA to opt out of the new tax regime. A new column has been added to claim deduction under section 80CCH in new ITR Forms 1 and 4. Capital gains accounts scheme Taxpayers using Income Tax Return (ITR) forms 2, 3, 5, and 6 are mandated to provide exhaustive information regarding the Capital Gains Account Scheme compared to the previous year's forms, where only the deposited amount was necessary. The revamped Schedule CG stipulates the inclusion of additional particulars such as the deposit date, account number, and IFSC code. Form 10-IEA must for ITR 4 filers ITR-4 or SUGAM is for individuals, HUFs and firms (other than LLP) whose total income is up to Rs 50 lakh and the income from business and profession that is calculated under sections 44AD, 44ADA or 44AE under Income Tax Act. Taxpayers opting for ITR 4 will now need to file Form 10-IEA to opt out of the new tax regime. Form 10-IEA was introduced to allow taxpayers to opt for the old regime if they wish to do so. The \"Receipts in Cash\" column has been added to ITR-4 to claim an enhanced turnover limit. Legal Entity Identifier requirement ITR forms 2, 3, 5, and 6 are income tax return forms used by taxpayers to report their income to the tax authorities in India. These forms require a Legal Entity Identifier (LEI), which is a unique 20-character alpha-numeric code. The LEI is used to identify parties involved in financial transactions globally. Taxpayers are mandated to provide their LEI when claiming a refund amounting to Rs 50 crore or more. This requirement ensures transparency and traceability in high-value financial transactions, aiming to prevent fraudulent activities and promote financial integrity. Acknowledgment number and UDIN requirement in ITR-6 Companies submitting ITR 6 must now include acknowledgment numbers and Unique Document Identification Numbers (UDIN) for audit reports as per section 44AB (tax audit report) and section 92E (transfer pricing report). Donations to political parties Details of contributions made to political parties must be disclosed in the new Schedule 80GGC, which is applicable to ITR forms 2, 3, 5, and 6. The required information includes the date of the contribution, contribution amount (including breakdown of cash and other modes), eligible contribution amount, transaction reference number for UPI transfer or cheque number/IMPS/NEFT/RTGS, and IFSC code of the bank. Deduction details for medical treatment For claiming deductions related to maintenance and medical treatment expenses for a dependent with a disability, details must be provided separately in Schedule 80DD (and not under Schedule VI-A). Required information includes: > Nature of the disability > Type of dependent (spouse, son, daughter, father, mother, brother, sister, or member of the HUF) > PAN of the dependent > Aadhaar number of the dependent > Date of filing and acknowledgment number of Form 10-IA > UDID Number. Agniveer Corpus Fund Section 80CCH of the Income Tax Act was introduced through the Finance Act 2023. This section enables individuals filing their tax returns through ITR forms 1, 2, 3, or 4 to seek a deduction for the amount deposited in the Agniveer Corpus Fund. As a result, a dedicated column has been added in \"PART C – DEDUCTIONS AND TAXABLE TOTAL INCOME\" to specify the eligible deduction amount. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/lifestyle/fashion/story/from-singapore-to-india-designer-mark-ong-talks-monsoon-patrol-limited-edt-collab-and-the-future-of-sneaker-culture-432026-2024-06-11",
    "title": "From Singapore to India: Designer Mark Ong talks Monsoon Patrol, Limited Edt collab, and the future of sneaker culture - BusinessToday",
    "published_date": "2024-06-11",
    "author_name": "Pranav Dixit",
    "author_url": "https://www.businesstoday.in/author/pranav-dixit",
    "article_content": "Feedback Imagine this: a rainy day, your favourite sneakers, and the dreadful moment your toes get soaked. Mark Ong, the visionary behind the sneaker customisation brand SBTG, took this everyday annoyance and turned it into a catalyst for innovation. Enter Monsoon Patrol, a footwear collaboration that has evolved into a full-fledged apparel collection with the creative input of GRAYE. This exciting journey, starting with a practical problem and leading to an international showcase, encapsulates the dynamic evolution of sneaker culture. Mark Ong reflects on this evolution, noting, \"Custom Culture in the sneaker world started out as an underground punk band and is now mainstream pop. It became this collective consciousness where if you had an idea, someone would have already done it.\" Monsoon Patrol's journey from a simple idea to a feature at Paris Fashion Week underscores the brand's promising future and its potential impact on the global fashion scene. This conversation with Business Today's Pranav Dixit will delve into Mark's creative process, the inspiration behind Monsoon Patrol, and his thoughts on the evolving landscape of sneaker culture, particularly as this collection gears up for its Indian release. PD: Monsoon Patrol started as a footwear collaboration. What drove the expansion into a full apparel collection with GRAYE? How did the collaboration with them influence the design direction? Mark Ong: The idea for Monsoon Patrol was always to be presented as a brand with no particular category as lead. We had a ticket to work with Asics during that time so we chose footwear first as it would make more noise. This year, we got introduced to GRAYE from Jebson of Zha Huo Dian and became a fan of their products. We find their designs very original and well thought out. We approached them later to work on a casual tech suit to go along with the shoes. PD: The collection is clearly built for functionality in challenging weather. Was there a specific experience or memory that sparked the initial idea for Monsoon Patrol? Mark Ong: It is very simple. I really hate it when my toes get wet in the rain, it would ruin my day so I had the thought that all shoes should have some sort of protective coating on the toes for this purpose. So I presented a problem which I feel we all experience and a sub-brand as a solution. Mandeep shared the same sentiment and that's when we decided to join forces to do Monsoon Patrol. PD: You've been a major figure in sneaker customisation for many years. How have you seen sneaker culture evolve, and where do you see collaborations like Monsoon Patrol fitting into the future of footwear and fashion? Mark Ong: Custom Culture in the sneaker world started out as an underground punk band and is now mainstream pop. It became this collective consciousness where if you had an idea, someone would have already done it. I feel blessed to have a 20-year headstart on it. Monsoon Patrol is a work-in-progress young brand that has an exciting future. Already having 3 collabs deep with ASICS and New Era, we will be showcasing the future of it in this year's Paris Fashion Week. PD: What are your impressions of the Indian sneaker scene, and what excites you about bringing Monsoon Patrol to a new audience? Mark Ong: The Indian sneaker scene is in its infancy stage but it couldn't have come at a better time. Everything is already set up for them to consume. Imagine having the choice of being served the best of the best to a big group of audience that is enthusiastic and open to trying new things. That was the vibe I got when I attended the opening of Limited Edt India. PD: What's next for Mark Ong and SBTG? Any exciting projects or collaborations on the horizon you can tease? Mark Ong: We have been on Fire lately with collabs dropping every month this year and we are not done yet. I find myself in a very good space with good management and team support. Opportunities have been coming non-stop too. Right after this launch, we will be flying to Paris to present the future of Monsoon Patrol and after we are back, It will be time to drop our Vans collab. Then I'll start thinking of Culture Cartel and Urban Sneaker Society. Never not working. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/markets/stocks/story/anil-agarwal-likely-to-sell-a-25-stake-in-vedanta-ltd-report-434264-2024-06-21",
    "title": "Anil Agarwal likely to sell a 2.5% stake in Vedanta Ltd: Report - BusinessToday",
    "published_date": "2024-06-21",
    "author_name": "Business Today Desk",
    "author_url": "https://www.businesstoday.in/author/business-today-desk",
    "article_content": "Feedback Mining Mogul Anil Agarwal-controlled Vedanta Resources is planning to sell off a 2.5% stake in Vedanta Ltd through block deals in July. The promoter group is likely to sell about 9 crore shares to raise around Rs 4,000 crore through block deals, a report in the Economic Times said. At the end of FY24 (March 31, 2024), Vedanta's promoters held a 61.95% stake in the company, down from 63.71% stake in December 31, 2023. In February this year, promoters had sold some stake in a block deal that was valued at over Rs 2,615 crore. In February this year, Finsider International, which is part of Vedanta Resources, sold more than 6.55 crore Vedanta shares for Rs 1,700 crore. The shares were sold at Rs 265.14 apiece. Starting December 2022, Vedanta's promoter shareholding has declined from nearly 70% to just over 60%. Earlier this week, Vedanta Resources said it will seek to cut its debt by $3 billion over the next three years. In its annual report, Agarwal said \"We seek to further deleverage Vedanta Resources by $3 billion over the next three years.\" Vedanta Resources has been grappling with a host of rating downgrades since last year as analysts flagged liquidity issues and high default risk. In the last two years, Vedanta Resources has cut its debt by $3.70 billion. Agarwal said the maturity of its outstanding bonds worth $3.20 billion, extended up to fiscal 2029, has provided it with \"newfound liquidity\". The group will use this liquidity to fund \"important capex projects,\" he added. Vedanta Ltd, which is in the middle of a planned demerger, aims to operationalise coal blocks and expand capacities for its steel and aluminium business and has proposed to set aside $1.90 billion as capital expenditure for fiscal 2025. This fiscal so far, the Vedanta Group, which includes Vedanta Ltd and Hindustan Zinc Ltd, has produced most wealth for its stock market investors, with combined market valuation growing by Rs 2.2 lakh crore. The Vedanta Group's market value increased by more over Rs 2.2 lakh crore between March 28 and June 20, 2024, according to stock exchange statistics shared by PTI. According to stock exchange data, it has been observed that the share prices of Vedanta and Hindustan Zinc have demonstrated remarkable growth, having doubled from their 52-week lows. This uplifting trend can be attributed to several favorable factors, including the impending demerger, the consistent focus of management on restructuring initiatives, and a discernible uptick in profitability. In a divergent scenario, the market capitalization of the Adani and Mahindra groups has surged by Rs 1.4 lakh crore each. Meanwhile, during the same period, the market valuation of heavyweight RIL witnessed a notable decline by more than Rs 20,656.14 crore. In contrast, the market cap of the Tata Group experienced a significant surge, escalating by over Rs 60,600 crore. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/indices/sp-bse-mid-cap",
    "title": "S&P BSE Mid-Cap Index Price Today, S&P BSE Mid-Cap share price, S&P BSE Mid-Cap Live Charts",
    "published_date": "Jun 21, 2024",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback DATA SOURCES: Corporate data, historical price & volume data published on this website have been sourced from CMOTS Internet Technologies Pvt. Ltd. BSE Quotes and NSE Quotes have been sourced from BSE Limited and NSE Data & Analytics Limited, respectively. All timestamps reflected here are in IST (Indian Standard Time). Stock Analysis section has been sourced from the mentioned partners. DISCLAIMER: Any and all content on this website, including the tools/ analysis, is provided to you only for convenience and on an “as-is, as-available” basis without representation and warranties of any kind. The content and any output of such tools/ analysis is for informational purposes only and should not be relied upon or construed as investment advice or guarantee for any specific performance/ returns advice or considered as recommendation for the purchase or sale of any security or investment. You are advised to exercise caution, discretion and independent judgment with regards to the same and seek advice from professionals and certified experts before taking any decisions. By using this website, you agree to the Terms of Service and Privacy Policy. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/industry/telecom/story/centre-issues-warning-against-picking-up-whatsapp-calls-with-foreign-origin-mobile-numbers-92-423408-2024-03-29",
    "title": "Centre issues warning against picking up WhatsApp calls with foreign-origin mobile numbers +92 - BusinessToday",
    "published_date": "2024-03-29",
    "author_name": "Business Today Desk",
    "author_url": "https://www.businesstoday.in/author/business-today-desk",
    "article_content": "Feedback The Department of Telecommunications, Ministry of Communications, on Friday issued an advisory alerting users that calls are being made in the name of DoT, wherein the users are being threatened that their mobile numbers would be disconnected or their mobile numbers are being misused in some illegal activities. The DoT has also cautioned them about WhatsApp calls from foreign-origin mobile numbers (like +92-xxxxxxxxxx) in which there are elements who are impersonating government officials and duping the people. “Cyber criminals through such calls try to threaten/steal personal information to carry out cyber-crime/financial frauds. The DoT does not authorise anyone to make such calls on its behalf and has advised people to stay vigilant and not share any information on receiving such calls,” an official notification said. The DoT has advised citizens to report such fraud communications at ‘Chakshu-Report Suspected Fraud Communications’ facility of Sanchar Saathi portal. Such proactive reporting helps DoT in prevention of misuse of telecom resources for cyber-crime, financial frauds, etc. Further, citizens can check the mobile connections in their name at ‘Know Your Mobile Connections’ facility of Sanchar Saathi portal and report any mobile connection not taken by them or not required. Further, citizens can check the mobile connections in their name at the ‘Know Your Mobile Connections’ facility of Sanchar Saathi portal (www.sancharsaathi.gov.in) and report any mobile connection not taken by them or not required. The DoT has also advised citizens to report at cyber-crime helpline number 1930 or www.cybercrime.gov.in in case anyone has already become a victim of cyber-crime or financial fraud. Amit Relan, co-founder and CEO, mFilterIt said, \"This is a great initiative to spread awareness and prevent misuse of mobile connections. Fake Profiles impersonation is a massive headache for GoI and individuals alike. Countering such threats requires awareness, vigilance, and a comprehensive monitoring system for organisations getting frequently impersonated online like law enforcement agencies, Telecom department, etc. We also collaborate with one of the largest banks to identify fraudulent activities - like mule accounts, UPI frauds, and other fraudulent activities with mobile numbers linked with accounts as key identifies. We detect approximately 18 to 20,000 cases every single day for a National Bank with suspicious activities scanning leveraging open-source intelligence across more than four thousand websites and social platforms. Trust and transparency are key to building an empowered and efficient digital India.\" Earlier this year, the DoT prohibited over 1,500 phone lines, inclusive of international numbers linked with cybercrimes and potential threats. These preventative measures are a proactive response to curtail the abuse of telecommunication resources amid the escalating occurrences of financial deception. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/best-advice/story/how-this-key-advice-helped-b-santhanam-turn-around-saint-gobain-india-433561-2024-06-17",
    "title": "How this key advice helped B. Santhanam turn around Saint-Gobain India - BusinessToday - Issue Date: Jun 23, 2024",
    "published_date": "Jun 23, 2024",
    "author_name": "Bt Team",
    "author_url": "BT Team",
    "article_content": "Feedback What was the problem you were grappling with? Back in the day, I was grappling with a difference of opinion with my team. I was using the same yardstick with everyone around me. This came to light during an annual conference, where several members spoke about the unrelenting pressure that was being exerted. I had just taken over the leadership role and my style was quite intense. The feedback came as a rude shock. Whom did you approach for advice and why? Although I did not approach him directly, Anand (Mahajan, who was the Managing Director then and later became Chairman of the company), being the perceptive leader that he was, noticed that I was disturbed. He did not voice any opinion in public, was sensitive and without being intrusive, suggested a shift in my leadership approach. What was the advice you received? Anand advised me to listen, learn, and adapt. He expressed confidence that I would overcome the business challenges in future. How effective was it in resolving the problem? That advice made me rethink my leadership style. And after that, I brought about several changes in terms of democracy, inclusion, etc., in the workplace. It has been over four decades now [since I received that advice], but I believe it was life-changing for me at a professional level and continues to be the same to date. I also learnt from Anand that a leader needs to be empathetic and not assume that everyone would have the same level of aspiration that a leader has. A leader should also be open to seeking feedback and incorporating it. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/stocks/persistent-systems-ltd-persistent-share-price-364881",
    "title": "Persistent Systems Ltd Share Price Today, PERSISTENT Share Price NSE, BSE",
    "published_date": "Jun 21, 2024",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback Persistent Systems Ltd, incorporated in the year 1990, has its registered office in Bhageerath, 402 Senapati Bapat Road, Pune, Maharashtra, 411016, 91-020-67030000/67462084, 91-020-67030008/67030009. The main industry in which Persistent Systems Ltd operates is Computers - Software - Large. Auditor/Auditors for Persistent Systems Ltd is/are Walker Chandiok & Co LLP. In the main management, Anand Deshpande is chairman and Amit Atre is the company secretary for Persistent Systems Ltd. DATA SOURCES: Corporate data, historical price & volume data published on this website have been sourced from CMOTS Internet Technologies Pvt. Ltd. BSE Quotes and NSE Quotes have been sourced from BSE Limited and NSE Data & Analytics Limited, respectively. All timestamps reflected here are in IST (Indian Standard Time). Stock Analysis section has been sourced from the mentioned partners. DISCLAIMER: Any and all content on this website, including the tools/ analysis, is provided to you only for convenience and on an “as-is, as-available” basis without representation and warranties of any kind. The content and any output of such tools/ analysis is for informational purposes only and should not be relied upon or construed as investment advice or guarantee for any specific performance/ returns advice or considered as recommendation for the purchase or sale of any security or investment. You are advised to exercise caution, discretion and independent judgment with regards to the same and seek advice from professionals and certified experts before taking any decisions. By using this website, you agree to the Terms of Service and Privacy Policy. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/stocks/lt-technology-services-ltd-ltts-share-price-366638",
    "title": "L&T Technology Services Ltd Share Price Today, LTTS Share Price NSE, BSE",
    "published_date": "Jun 21, 2024",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback L&T Technology Services Ltd, incorporated in the year 2012, has its registered office in L&T House N M Marg, Ballard Estate, Mumbai, Maharashtra, 400001, 91-22-67525656, 91-22-67525893. The main industry in which L&T Technology Services Ltd operates is Computers - Software - Large. Auditor/Auditors for L&T Technology Services Ltd is/are MSKA & Associates. In the main management, A M Naik is chairman and Prasad Shanbhag is the company secretary for L&T Technology Services Ltd. DATA SOURCES: Corporate data, historical price & volume data published on this website have been sourced from CMOTS Internet Technologies Pvt. Ltd. BSE Quotes and NSE Quotes have been sourced from BSE Limited and NSE Data & Analytics Limited, respectively. All timestamps reflected here are in IST (Indian Standard Time). Stock Analysis section has been sourced from the mentioned partners. DISCLAIMER: Any and all content on this website, including the tools/ analysis, is provided to you only for convenience and on an “as-is, as-available” basis without representation and warranties of any kind. The content and any output of such tools/ analysis is for informational purposes only and should not be relied upon or construed as investment advice or guarantee for any specific performance/ returns advice or considered as recommendation for the purchase or sale of any security or investment. You are advised to exercise caution, discretion and independent judgment with regards to the same and seek advice from professionals and certified experts before taking any decisions. By using this website, you agree to the Terms of Service and Privacy Policy. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/userfeedback?ref=indices%2Fnifty-it&feedbackto=&siteId=1&type=feedback",
    "title": "User Feedback",
    "published_date": "01 Jan 1970",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/stocks/mphasis-ltd-mphasis-share-price-362790",
    "title": "Mphasis Ltd Share Price Today, MPHASIS Share Price NSE, BSE",
    "published_date": "Jun 21, 2024",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback Mphasis Ltd, incorporated in the year 1992, has its registered office in Bagmane World Tech Center, Marathalli RingRd Mahadevapura, Bengaluru, Karnataka, 560048, 91-80-6750 1000, 91-80-6695 9943. The main industry in which Mphasis Ltd operates is Computers - Software - Large. Auditor/Auditors for Mphasis Ltd is/are BSR & Co LLP. In the main management, Davinder Singh Brar is chairman and Subramanian Narayan. is the company secretary for Mphasis Ltd. DATA SOURCES: Corporate data, historical price & volume data published on this website have been sourced from CMOTS Internet Technologies Pvt. Ltd. BSE Quotes and NSE Quotes have been sourced from BSE Limited and NSE Data & Analytics Limited, respectively. All timestamps reflected here are in IST (Indian Standard Time). Stock Analysis section has been sourced from the mentioned partners. DISCLAIMER: Any and all content on this website, including the tools/ analysis, is provided to you only for convenience and on an “as-is, as-available” basis without representation and warranties of any kind. The content and any output of such tools/ analysis is for informational purposes only and should not be relied upon or construed as investment advice or guarantee for any specific performance/ returns advice or considered as recommendation for the purchase or sale of any security or investment. You are advised to exercise caution, discretion and independent judgment with regards to the same and seek advice from professionals and certified experts before taking any decisions. By using this website, you agree to the Terms of Service and Privacy Policy. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/best-advice",
    "title": "Business Today Magazine: Best Advice, BT Mag Best Advice",
    "published_date": "2024-06-17",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback Saint-Gobain is a designer, manufacturer and distributor of construction material. Here, the CEO of its Asia-Pacific and India region speaks about the best advice he received Thryve Digital is a player in the healthcare technology sector delivering next-generation solutions US-based Coursera is a leading edtech platform that has partnerships with global institutions Founder & CEO of Cars24, Vikram Chopra on how this piece of advice from Rajeev Jain of Bajaj Finance helped him in his professional life. The family-led Muthoot Finance faced challenges in the gold loans business, including protecting their family reputation in an unexplored market. By seeking wise advice and implementing a thorough and prompt business approach, it successfully navigated operational issues and promoted growth Naveen Kukreja, Co-founder & CEO, Paisabazaar on the best advice he ever received Business Today in conversation with Juan Pablo Rodriguez, CEO of Hindustan Coca-Cola Beverages Business Today, in conversation with Tamer Kadry, Country General Manager, Mars Wrigley India, which is the domestic arm of global confectionery major Mars Wrigley Business Today in conversation with Ananth Chandramouli, Managing Director, India Business Unit Capgemini Business Today, in conversation with Nitin Rakesh, CEO, Mphasis Business Today in conversation with Amit Chadha, CEO & MD of L&T Technology Services Jaga Jagadish, Country Head & SVP-Silicon Design Engineering at AMD India, opens up about the best advice she ever received professionally. Modi Enterprises' MD Samir K. Modi on the best advice he ever received and how it changed his life Mehul Pandya, MD and CEO of CareEdge, in conversation with Business Today Business Today in conversation with Om Prakash Manchanda, MD, Dr Lal Pathlabs Ltd. Business Today in conversation with Shyam Sundar Aggarwal, Managing Director of Bikanervala Foods Pvt. Ltd. Gauri Shankar Nagabhushanam, CEO of India Business Parks on the best advice he ever received Business Today in conversation with Sanjay Khanna, CEO and Country Manager, American Express Kailash Katkar, MD, Quick Heal Technologies, in conversation with Business Today, opens up about the best advice he received. Manish Gupta, Chairman and CEO of Indegene Ltd., in conversation with Business Today Alok Tandon, Co-Chief Executive Officer, PVR INOX, in conversation with Business Today Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/stocks/coforge-ltd-coforge-share-price-365162",
    "title": "Coforge Ltd Share Price Today, COFORGE Share Price NSE, BSE",
    "published_date": "Jun 21, 2024",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback Coforge Ltd, incorporated in the year 1992, has its registered office in 8 Balaji Estate 3rd Floor, Guru Ravi Das Marg Kalkaji, New Delhi, New Delhi, 110019, 91-11-41675000, 91-11-41407120. The main industry in which Coforge Ltd operates is Computers - Software - Medium / Small. Auditor/Auditors for Coforge Ltd is/are S R Batliboi & Associates LLP. In the main management, Basab Pradhan is chairman and Barkha Sharma is the company secretary for Coforge Ltd. DATA SOURCES: Corporate data, historical price & volume data published on this website have been sourced from CMOTS Internet Technologies Pvt. Ltd. BSE Quotes and NSE Quotes have been sourced from BSE Limited and NSE Data & Analytics Limited, respectively. All timestamps reflected here are in IST (Indian Standard Time). Stock Analysis section has been sourced from the mentioned partners. DISCLAIMER: Any and all content on this website, including the tools/ analysis, is provided to you only for convenience and on an “as-is, as-available” basis without representation and warranties of any kind. The content and any output of such tools/ analysis is for informational purposes only and should not be relied upon or construed as investment advice or guarantee for any specific performance/ returns advice or considered as recommendation for the purchase or sale of any security or investment. You are advised to exercise caution, discretion and independent judgment with regards to the same and seek advice from professionals and certified experts before taking any decisions. By using this website, you agree to the Terms of Service and Privacy Policy. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/event/story/bts-most-powerful-women-in-business-awards-celebrating-success-377676-2023-04-17",
    "title": "BT's Most Powerful Women in Business awards: Celebrating success - BusinessToday - Issue Date: Apr 30, 2023",
    "published_date": "Apr 30, 2023",
    "author_name": "Team Bt",
    "author_url": "Team BT",
    "article_content": "Feedback The stars came out early on a Friday evening in March as Business Today celebrated the success and achievements of The Most Powerful Women in Business, with a host of women leaders at St. Regis Mumbai. Kicking off the evening’s proceedings was an agenda-setting discussion on ‘Leadership’s Female Quotient’, helmed by Tarun Khanna, Jorge Paulo Lemann Professor of Harvard Business School. Following it were several interesting discussions featuring Zia Mody, Co–founder and Managing Partner at AZB & Partners; Arundhati Bhattacharya, Chairperson and CEO of Salesforce India; Swati Piramal, Vice Chairperson of Piramal Group; and Nandita Das, Film-maker and Actor, among other eminent personalities from the fields of business, sports and entertainment, who held forth on the challenges faced by women at work and the ways to overcome them. Mamaearth Co-founder Ghazal Alagh; Sangita Reddy, Joint MD of Apollo Hospitals; HCL’s Roshni Nadar Malhotra; and SUGAR Cosmetics Co-founder and CEO Vineeta Singh were among the achievers honoured at the recent event to celebrate the 19th edition of BT MPW. The awards were given away by Union Minister Smriti Irani. The list of 55 trailblazing women winners represented both continuity and change as the evening saw nine debutantes, 31 repeat winners from last year and seven comebacks from earlier years, from fields as varied as textiles, pharma, entertainment, start-ups, finance and manufacturing, among others, take home the award. Three women—Nita Ambani of Reliance Foundation, Kaku Nakhate of Bank of America and Priya Nair of Unilever—who are seven-time winners of the award, entered BT’s prestigious MPW Hall of Fame, making way for newer entrants in the coming year. A highlight of the evening was the talk by actor-turned-politician Irani, Union Minister of Women & Child Development and Minister of Minority Affairs, on ‘Leveraging India’s Better Half for Economic & Social Growth’. The evening also saw Indian cricketers Jemimah Rodrigues and Harleen Deol break into a song at the end of their session called ‘Trailblazers: Cricket’s New Icons’; the panel also included former Indian cricketers Jhulan Goswami and Hrishikesh Kanitkar—who is also their coach. Started in 2003, Business Today was the first magazine to champion this glittering annual list of star women achievers in India. And here’s hoping that the coming years will see an even more diverse set of women grace the list. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/event/story/bt-golf-kolkata-edition-was-a-glittering-affair-377681-2023-04-17",
    "title": "BT Golf Kolkata edition was a glittering affair - BusinessToday - Issue Date: Apr 30, 2023",
    "published_date": "Apr 30, 2023",
    "author_name": "Team Bt",
    "author_url": "Team BT",
    "article_content": "Feedback Called the city of Joy, Kolkata—known for its unbound exuberance, culture, traditions, history, literature, food and more—played the perfect host on March 25, 2023, for the concluding edition of the Royal Ranthambore presents Business Today Golf tournament at the historic and adventurously difficult Tollygunge Club—that started life as a plantation and which has gone through several iterations before its current avatar of a golf course set in the heart of bustling South Kolkata. As one of the oldest courses in this part of the world, the greens here have a character of their own, much like the city it resides in. For instance, this is one golf course where walking is par for the course as golf carts are not allowed because they may damage the pristine greens. The tournament, held at the 18 hole, 70 par, 100-acre championship all-season golf course, saw participation from more than 100 corporate captains of Kolkata. The chief guest for the occasion was West Bengal Industry, Commerce and Enterprises Minister Shashi Panja, who felicitated the winners. The exclusive, invite-only tournament, of which this was the fifth and last leg for the 2022-23 season, is co-powered by Qatar Airways and Indian Oil XP 100 with Morris Garages as mobility partner and Rajasthan Tourism as tourism partner. As for the winners, Sheena Rawla, Interior Architect & Designer at The Colonial Design House, who tallied 30 points, won in the ladies category. Pavan Ghai, Director of Mojo Footwear and Partha S. Barman, Managing Director at Highstreet Securities, amassed 36 and 37 points, respectively, to be declared winners in the 0 to 14 handicap category and 15 to 24 handicap category, respectively. Presenting the awards to the winners, Minister Panja, a physician by training, said, “I can say with complete conviction that the Tollygunge Club, or the Tolly as we all know it, is one of the best and most exquisite golf courses in all of India. And West Bengal’s turf is as smooth as the grass at the Tolly, so I would say to the participants, do come back to this state of opportunity.” Amongst the winners of the individual prizes were Harmander Bindra, Director of processWare ERP, for the Straightest Drive; Satbinder Singh, Partner at Sen & Singh Engineers, for the Closest to Pin; and Jayanta Gohain, Head-Tea Excellence Centre of Hindustan Unilever, for the Longest Drive. Wrapping up the day’s and this season’s game play, Panja said, “P.G. Wodehouse said, ‘play golf with a man’—with all emphasis on gender neutrality here—‘to know his character’. We in West Bengal invite you all to do the same. And I must say BT Golf put up a most impressive show here today.” And like they say, it’s a birdie. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/event/story/smells-like-tee-spirit-bt-golf-2023-24-kicks-off-in-delhi-406584-2023-11-23",
    "title": "Smells like tee spirit: BT Golf 2023-24 kicks off in Gurgaon - BusinessToday - Issue Date: Nov 26, 2023",
    "published_date": "Nov 26, 2023",
    "author_name": "Team Bt",
    "author_url": "Team BT",
    "article_content": "Feedback More than a 100 corporate leaders took to the greens on a crisp Saturday morning this October to kick off the much-awaited Royal Ranthambore Business Today Golf 2023-24 tournament with panache. The season—which will see the tournament travelling to six more cities in the course of the next few months—could not have asked for a better start than the one it received at the Classic Golf and Country Club near Gurugram in Delhi-NCR on October 21. Apart from the corporate honchos who teed off that day were two former cricketers who were part of India’s World Cup-winning squads: Madan Lal from the team that won in 1983, and Suresh Raina, who was part of the winning team in 2011. Not just renowned cricketers (former player Murali Kartik was also present) but up and coming pro golfers like Aman Raj, currently No. 2 on the domestic PGTI Rankings, were also present to cheer the players on and share their insights on the players’ game. The expanded tournament’s first leg—that had a full house and perfect autumn weather—witnessed close competition among the 120 golfers who participated. Pooja Ahluwalia, Director of Ahluwalia Dream Developers; Mahaveer Singhvi, Joint Secretary in the Ministry of External Affairs; and Rajiv Kumar Pandey, Director General of Audit (Central Expenditure) in the Indian Audit and Accounts Department emerged as winners in the ladies, 0-14 Men’s handicap, and 15-24 Men’s handicap categories, respectively. With tight competition being witnessed in the Men’s 15-24 handicap section, Pandey won based on the performance in the last six holes after he was tied with Ravinesh Kumar, Chief Administrative Officer of Indian Railways, on 46 points. Ahluwalia topped the ladies category with 34 points, while Singhvi won the Men’s 0-14 handicap section with 46 points, ahead of Siddharth Sangwan, MD-Talent at Lightspeed India, who secured 44 points. Going forward, Qatar Airways will co-power the seven-city season that will wrap up in March 2024. Bandhan Mutual Fund will support the tournament as its investment partner, Darwin Platform Group of Companies as conglomerate partner, O3+ as gifting partner, and MG Motor India as the driving force for the tournament. While the first leg also saw the likes of Deshant Kaila, MD of PepsiCo GBS India; Anubhav Jain, CEO of Silverglades; Pankaj Tandon, CEO and Joint MD of Jakson Group (EPC Business); Vineet Sharma, Head of Product Management-Trade at IndusInd Bank; Anmol Puri, Partner at Deloitte; Rajesh Sud, MD-Financial Services at Bharti Enterprises; and Anuj Dayal, Executive Director at Delhi Metro Rail Corporation tee off in the hunt for honours and on-course prizes, the upcoming games promise to be as exciting as the one that just concluded, if not more. So, stay tuned. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/event/story/bt-golf-kolkata-corporate-bigwigs-turn-up-in-huge-numbers-at-the-iconic-tolly-club-to-showcase-their-golfing-chops-408417-2023-12-06",
    "title": "BT Golf Kolkata: Corporate bigwigs turn up in huge numbers at the iconic Tolly Club to showcase their golfing chops - BusinessToday - Issue Date: Dec 10, 2023",
    "published_date": "Dec 10, 2023",
    "author_name": "Team Bt",
    "author_url": "Team BT",
    "article_content": "Feedback Away from the hustle and bustle of the City of Joy on a balmy Saturday morning, more than a hundred golfers assembled at the historic Tollygunge Club in the posh southern part of Kolkata to compete on the greens. The city had been drenched in showers a day before, but the skies were clear when the first golfers ambled in at 6:45 in the morning to register for the exclusive and invite-only Royal Ranthambore Business Today Golf 2023-24’s Kolkata leg of the tournament. By the time they teed off at 8 am, it was bright and sunny, and all the participants were pumped up and ready for action. Over the next few hours, they showcased their golfing chops in the sun, displaying great competitive spirit and camaraderie. Even though most in the field were familiar with the twists and turns of the Tolly Club’s 18-hole, 70-par, 100-acre championship all-season course, which was originally started as a plantation, they still had to contend with its quick greens and strategically placed pins, along with the multiple hazards scattered across the fairways and, of course, the intense heat and humidity. The draw was heavily dominated by corporate leaders such as Amit Bhowmik, Head of Procurement-RSE & Asean & South Asia of Linde India; Hitesh Gurtu, Head of Marketing-South Asia at Linde India; Murali Ganesan, Executive VP & Head of Audit of ITC Ltd; Gaurav Soneja, GM of ITC Royal Bengal; Ranabir Chatterjee, VP-Deliver & SHEQ-South Asia of Praxair India; Joydeep Datta Gupta, Senior Director, Deloitte Touche Tomahatsu India; Sunil Jha, MD of Shristi Infrastructure Development Corp.; and Arnab Basu, Leader Advisory and Regional Managing Partner, PwC India. There were others as well, such as B. Sumant, Director of ITC Ltd; Harsh Pal Singh, Vice President-Marketing, Residential Sales, Shristi Infrastructure Development Corp.; Vijay Jacob Parakkal, Senior Vice President & Managing Partner, Wunderman Thompson; and Sanjeev Mehra, Senior Vice President, RP-Sanjiv Goenka Group. Finally, after four hours of play, Oona Khanna, Nutritionist & Health Coach; A.K. Sareen, former MD of Ceratizit India; and Dinesh Agarwal, Partner, EY, emerged as the winners in the ladies, 0-14 Men’s handicap and 15-24 Men’s handicap categories, respectively. West Bengal Industry, Commerce and Enterprises Minister Shashi Panja, who graced the event as the chief guest, felicitated the winners and said, the city is in the grip of a sports wave. “It’s a season full of sport for us. We have a cricket World Cup match here tomorrow so the flavour of the season is sports, sports and sports, and golf is not very far behind,” she said. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/event/story/bt-golf-hyderabad-for-indian-business-leaders-it-was-all-competitive-camaraderie-on-the-links-409839-2023-12-18",
    "title": "BT Golf Hyderabad: For Indian business leaders it was all competitive camaraderie on the links - BusinessToday - Issue Date: Dec 24, 2023",
    "published_date": "Dec 24, 2023",
    "author_name": "Bt Team",
    "author_url": "BT Team",
    "article_content": "Feedback After almost a year, BT Golf returned to the City of Pearls for the Hyderabad leg of the 2023-24 season. The exclusive and invite-only event saw close to a hundred golfers hitting the links on a balmy Saturday (November 18, 2023) morning at the Boulder Hills Golf and Country Club. Nestled amidst the offices of global IT giants like Infosys and Microsoft, the 18-hole championship course is considered one of the toughest in the country. Strategically located natural boulders and the presence of water bodies throughout the course provided ample challenges for the corporate warriors, even though many were familiar with the course. Over the next few hours, the who’s who of Hyderabad’s corporate world took on each other at the greens, showcasing their prowess with a putter and a club in a competitive display of camaraderie that had everyone in attendance wishing for an encore. Finally, psychiatrist Swetha Gullapalli (32 points) emerged as the winner of the Hyderabad leg of Royal Ranthambore BT Golf 2023-24 in the ladies’ category, while Vasu Merugu, VP-Product & Analytics at Head Digital Works, won the award in the 0–14 men’s handicap category and Vidyasagar (33 points) won in the 15–24 men’s handicap category. Syed Akbaruddin, India’s former Permanent Representative to the UN and currently the Dean of the Kautilya School of Public Policy, was the chief guest and gave away the prizes. Speaking at the post-event presentation, he said, “I came to Hyderabad thinking I would retire and play golf, but I see that the young people have done much better than me. So, perhaps it fits in better while you are active and tired, and retired players like me don’t do very well, so congratulations to all of you. Hyderabad is a boom town, and golf is also booming here.” Among the other players who teed off on Saturday in the iconic city of the Charminar and Golconda Fort were Srinivasa Rao Aluri of QuNu Labs, Vinayak Reddy Chintapally of JPMorgan, Anil Yamani of OSI Digital, Q-Mart’s B.V.K. Raju, Deepak Gullapalli of Head Digital Works, Murali Bukkapatnam of Volksy Technologies, A.V.N. Reddy of Roshni Crop Sciences, and Ravi S. Athmakuri of Lemongrass Consulting. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/event",
    "title": "Business Today Magazine: Event, BT Mag Event",
    "published_date": "2023-12-18",
    "author_name": "Not Available",
    "author_url": "Not Available",
    "article_content": "Feedback A spirit of competitive camaraderie permeated the business world during the Hyderabad leg of the BT Golf 2023-24 tournament Corporate bigwigs turned out in massive numbers to display their golfing chops at the Tolly Club for the Kolkata leg of BT Golf Business Today Golf kicked off its new season in Delhi, with six more cities to follow The concluding leg of Business Today Golf 2022-23 season saw the who's who of Kolkata's corporate world teeing off at the iconic Tolly club The BT MPW awards recognise the most successful women achievers from various fields of business BT Golf's Bengaluru edition saw the creme-de-la-creme of the corporate world indulging in a camaraderie-filled game of golf The BT Banking & Economy Summit, topped by the BT Best Banks Awards, engaged the creme de la creme of India's banking and financial services industry Amid fears of a global recession in the air, the country is in a bright spot At The BT Market Today Summit, the who's who of Indian bourses turned up in huge numbers and spread their wisdom The felicitation ceremony of the 18th Business Today Most Powerful Women in Business awards was a balanced mix of what has been achieved and what remains to be done Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/trends/story/wearables-major-boults-varun-gupta-gets-his-adrenaline-rush-through-adventure-sports-411089-2024-01-02",
    "title": "Wearables major Boult's Varun Gupta gets his adrenaline rush through adventure sports - BusinessToday - Issue Date: Jan 07, 2024",
    "published_date": "Jan 07, 2024",
    "author_name": "Nidhi Singhal",
    "author_url": "https://www.businesstoday.in/author/nidhi-singhal",
    "article_content": "Feedback Varun Gupta, 33, travels frequently for work. But the Co-founder of home-grown wearables brand Boult makes it a point to also plan for weekend getaways during work trips—whether he is in Europe, the US or China. Of all the places he has explored till date, the Alps in Europe are his favourite. “It seamlessly combines everything I hold dear in my travels—from the intricate charm of historical architecture to the awe-inspiring beauty of nature. The European Alps, with their harmonious blend of artistic allure and breathtaking landscapes, have a way of enchanting every fibre of my being,” says Gupta, who also loves strumming the guitar. But more than architecture, the Alps provide the perfect playground for this adrenaline junkie. From thrilling ski runs to heart-pounding snowboarding adventures, the snow-covered slopes offer an exhilarating experience that complements Gupta’s love for adventure sports. “The sheer rush of gliding down the powdery slopes amidst the stunning alpine vistas is unmatched,” says Gupta, a sports enthusiast who got into adventure sports while studying for his MBA. Not just mountains, Gupta loves beaches as well. His travels in Southeast Asia introduced him to water sports—from scuba diving and snorkelling to kayaking—each fostering a deep connection with the serene beauty of the ocean. But snow sports are his first love. Snow sports have taken Gupta to numerous breathtaking locations, such as the majestic Hampta Pass in the Himalayas. “The awe-inspiring vistas and the sheer physical challenge of these mountainous terrains serve as a testament to my resilience and unwavering determination,” says Gupta. The beauty of skiing, he adds, lies in its simplicity, where all that’s needed are a pair of snow blades and boots. And, he adds, a delicate balance of calculated risk and physical prowess, which keep his senses sharp and spirit invigorated. As a skiing destination, Gulmarg—with its majestic slopes and unparalleled beauty—holds a special place in his heart. “Unlike many European counterparts where costs can quickly escalate, Gulmarg provides an economical yet exhilarating skiing experience that remains accessible to a broader spectrum of adventure seekers,” he says. @nidhisingal Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/trends/story/celebrate-new-year-2024-in-a-unique-way-heres-how-411090-2024-01-02",
    "title": "Celebrate New Year 2024 in a unique way; here's how - BusinessToday - Issue Date: Jan 07, 2024",
    "published_date": "Jan 07, 2024",
    "author_name": "Smita Tripathi",
    "author_url": "https://www.businesstoday.in/author/smita-tripathi",
    "article_content": "Feedback Swimming with Sharks The idea of coming face to face with one of nature’s most agile predators may not be everyone’s idea of a New Year celebration but make ‘overcoming your fears’ your New Year resolution and jump in. To be honest, swimming with sharks is actually much safer than you think. You can either scuba dive with sharks in many parts of the world or swim with sharks in cage diving, where swimmers are put in protective cages that sharks are not able to penetrate. Some popular destinations include Hawaii, South Africa, Australia and the Bahamas. In front of a massive bonfire The Dutch love their bonfires and on New Year’s Eve, the towns of Scheveningen and Duindrop compete to build the world’s largest bonfire. The locals begin to assemble wood a few days ahead of time to prepare for the massive conflagration. Bonfires have been a large part of Icelandic culture since the Middle Ages and are also well-known in Reykjavik. So go ahead, kick off 2024 in front of the world’s largest or second-largest bonfire in the Netherlands. Running a Midnight Race If your New Year resolution is to get more fit, there is no better way to start the year than running a midnight race. The New York Road Runners organise a four-mile run at Central Park on New Year’s Eve. There’s music and dancing for everyone leading up to the race which kicks off at 11:59 pm and is accompanied by a fireworks show. You will have plenty of company with approximately 4,000 runners and even more spectators, many donning costumes. Or you could run the Shrewsbury Midnight Run in the UK. First place to welcome the New Year While Sydney, Australia, receives the lion’s share of media attention for having one of the first celebrations of the new year, it is Tonga, which is the first country in the world where the New Year dawns. Made up of more than 170 South Pacific islands, the main island is Tongatapu, a coral island with plenty of sandy beaches. Go for snorkelling, island hopping and sea kayaking in the protected lagoon. Oh! and when you see the first dawn of the New Year, don’t forget to greet others by saying, “Ofa kemou ma’u ha ta’ufo’ou monu’ia”— Tongan for Happy New Year! Last place to welcome the New Year Just over 500 miles away from Tonga, be among the last to welcome 2024 in American Samoa. Technically, the clock will last strike midnight on Baker Island in the South Pacific. However, Baker Island is uninhabited, so you’ll need to celebrate an hour earlier in American Samoa. Charter a flight between Tonga and American Samoa and you can celebrate New Year twice on the same day! Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/trends/story/downtime-how-baking-taught-pearson-indias-vinay-swamy-essential-lessons-in-leadership-419565-2024-03-06",
    "title": "Downtime: How baking taught Pearson India’s Vinay Swamy essential lessons in leadership - BusinessToday - Issue Date: Mar 03, 2024",
    "published_date": "Mar 03, 2024",
    "author_name": "Nidhi Singhal",
    "author_url": "https://www.businesstoday.in/author/nidhi-singhal",
    "article_content": "Feedback A qualified chartered accountant and a corporate finance leader, Vinay Swamy, Country Head of learning company Pearson India, keeps a busy schedule. Yet, he has figured out ways to keep himself focussed and pumped up through the work week by spending his ‘me time’ doing something that delights him. For starters, he spends his mornings relaxing in his terrace garden. And every other week, he indulges himself by baking cakes. Baking, he says, helps him to unwind, connect with his family, and create memories with them. For this baking enthusiast, the journey started in 2014, when he decided to turn his love of baking into a meaningful pursuit. And for that, he enrolled in a certification course at the Bengaluru-based Institute of Baking & Cake Art. “This allowed me to bake a strawberry cake for my mother-in-law’s 60th birthday. It’s been 10 years now, and she still recalls it as one of the best cakes she has ever had,” Swamy says with a smile. The Pearson India boss says his ardour for baking has also played a pivotal role in his parenting journey. He recalls how he began baking delectable chocolate cakes nearly every week for his wife when his younger daughter Maanya was on the way. “This not only heightened my love for baking, but it also became a medium to craft some of my most cherished memories,” he says, adding that now, every moment spent baking with his children is a treasure for him. Not only do these baking sessions bring them closer, he says, but they also give him an opportunity to impart vital life skills to his children. For him, it’s a fun way of forging connections and cultivating endearing memories, and at the same time sharing in the sheer delight of baking a delicious cake. Swamy says that the true joy of baking is not just in the end product, but in the process of making a cake. It’s a meticulous process that requires careful planning and foresight, which Swamy says, has helped him organise his life better. “When I engage in baking, I meticulously plan my entire day in advance, detailing every step necessary for a successful outcome. This practice of crafting a comprehensive to-do list has significantly improved my ability to organise and manage my time,” he says. Patience and an acute attention to detail are the other by-products of baking that he has gleaned. Swamy believes that experiential learning is the best way to learn and grow in any task as it allows you to practice in a controlled environment. “The idea of enrolling in an immersive five-day course was exactly this. Gain knowledge by experimenting with recipes, share ideas with the fellow participants, and create recipes first-hand. The hands-on learning experience enabled me to explore more ingredients, and grasp their nuances more effectively.” Over the years, Swamy’s baking chops have evolved to include a wide repertoire of delectable treats. And he has gained a well-deserved reputation for his mastery of crafting sumptuous chocolate cakes, a skill that even his family holds in high regard. Talk to him about his choicest recipes, and he is all smiles talking about them. “I’ve got classic favourites like chocolate cake and banana walnut cake. I’ve also created healthier options like eggless and wheat flour-based cakes. But the most important thing—that makes my baking special—is the love and happiness I put into every single thing I make. Each baked treat isn’t just food; it’s a way for me to share the happiness this skill brings into my life.” Other than a medium to plan, bond with loved ones, and create memorable family moments, baking is a creative outlet for Swamy that fosters relaxation and enables him to channel his energies positively. With the modest investment in learning, acquiring an oven and essential baking tools, he has not just managed to create delightful treats for his family and friends, but also found a delicious way to share warmth and joy with them on countless Sunday mornings. @nidhisingal Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/trends/story/is-the-tie-dead-heres-why-the-de-facto-office-wear-has-been-reduced-to-an-oddity-424269-2024-04-04",
    "title": "Is the tie dead? Here's why the de facto office wear has been reduced to an oddity  - BusinessToday - Issue Date: Mar 31, 2024",
    "published_date": "Mar 31, 2024",
    "author_name": "Smita Tripathi",
    "author_url": "https://www.businesstoday.in/author/smita-tripathi",
    "article_content": "Feedback I love people-watching on visits to foreign shores, whether it is the morning rush hour commute on the subway, or the hordes of people who stop to grab a sandwich at lunch hour—just regular people going about their business without bothering with some tourists gaping at them. But gape I do, and I see everything from high heels to sneakers, from fitted skirts to pant suits, from suits to jackets to hoodies. But what I don’t see enough of anymore are ties. It’s the same story in corporate India. The tie, that essential bit of clothing for corporate dressing that could take a backseat only on Fridays, when it was considered fine to be casually dressed, is no longer considered a must. “I have around 50 ties. Some exceptional ones are from brands like Versace and Paul Smith and others are unique and quirky. They all have two things in common—they are beautiful and useless,” says Delhi-based banker Aman Khanna. He has been working in the banking industry for over two decades and laments the time when dressing up for work definitely meant adorning one of his precious ties. “Banking has been a conservative industry as far as dressing is concerned, but even that is now changing, with the tie no longer considered compulsory.” There was a time when the tie was a de facto part of everyday dressing. But it has been losing ground for years, between the advent of casual Fridays, the work-from-home (WFH) days of the Covid-19 pandemic, and the blurring of lines between our personal and professional lives. The likes of Steve Jobs and Mark Zuckerberg, with their turtlenecks/sweatshirt and jeans, have a role to play in that. Take a look at global movers and shakers from the past couple of decades, and you will find that fewer and fewer have gone fully formal. Virgin Group Founder and billionaire Richard Branson has eschewed ties for years, as have Jeff Bezos and even Bill Gates. Tie-free world leaders include US President Joe Biden, French President Emmanuel Macron, Canadian Prime Minister Justin Trudeau, along with former UK PM Boris Johnson, and the Italian and Japanese prime ministers, who all abandoned silk ties for the official portrait at the G7 summit in Germany in 2022—marking the first time in 40 years this had happened. Barack Obama set the precedent as President, when he preferred the tie-less-rolled-up-sleeves look at the White House, except for formal occasions. In the corporate world, even before the WFH days of the pandemic, in 2019, Goldman Sachs, historically known as a white-shoe investment bank, with its bankers in bespoke suits and ties, issued an internal memo relaxing the dress code for all its employees. How significant this move was became evident from the fact that it was carried as news by leading international publications, as it was once considered unimaginable for the Wall Street firm. It was done to bring the bank’s traditional policies up to date for its younger workforce—nearly 75% of Goldman employees are Gen Z, or Millennials. Today, it is comfort that wins over stiff corporate attire, and that’s true not only for the younger generation but also for those who have been working in the corporate sector for a long time. “I wear ties nowadays for events as statement clothing. The work environment today is more about performance and less about formality. It’s the mental ease,” says Sharad Gautam, a senior executive with a leading global alco-bev company. Agrees Aman Vohra, a management consultant-turned digital content creator: “In today’s dynamic work culture, where flexibility and personal expression are increasingly valued, the once rigid dress codes have been relaxed, allowing individuals to explore a wider range of styles.” Of course, the tie will always be a part of a man’s wardrobe. But has it been reduced to a special events-only garment? A relic of tradition and redolent with historical meaning but not relevancy? Even Ermenegildo Zegna, Chief Executive of Zegna, has given up on ties. “Let me be clear: the suit is not dead,” Zegna said at a luxury conference in May 2022. “But the tie is!” “Although ties still hold significance in certain professional settings and events, I feel that more or less, their usage seems to be very limited. They will definitely remain a symbol of elegance and sophistication in menswear, but customers have started leaning towards ties as formal or else occasion wear, though to me it signifies old world elegance and unmatched style,” says designer Varun Bahl. In India, the rise of Indian wear at formal occasions is also impacting the wearing of ties. “Over the years, I have realised that a smart bandhgala is far more comfortable and chic,” says 47-year-old PR professional Sayantan Sinha. Agrees digital content creator, Riaan George: “We are not wearing ties even on formal occasions as in India a lot of us have adopted the bandi (Nehru) jacket instead of the blazer. Even Air India and Vistara have ditched the ties for their male attendants, replacing them with bandi jackets.” While looking around us, we may feel that the tie is losing its significance in men’s fashion, it hasn’t impacted sales. As per research firm Verified Market Reports, the size of the global ties market is expected to grow at a CAGR of 6.9% to $261.78 million by 2030 from $153.5 million in 2023. At the end of the day, you choose to tie or not to tie! @smitabw Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
{
    "article_url": "https://www.businesstoday.in/magazine/trends/story/unlocking-the-protein-potential-heres-tempeh-your-vegetarian-diets-new-best-friend-427812-2024-05-01",
    "title": "Unlocking the protein potential: Here's tempeh, your vegetarian diet's new best friend - BusinessToday - Issue Date: Apr 14, 2024",
    "published_date": "Apr 14, 2024",
    "author_name": "Smita Tripathi",
    "author_url": "https://www.businesstoday.in/author/smita-tripathi",
    "article_content": "Feedback Vegetarians rejoice. There’s a new kid on the block to take care of most of your protein requirements, and what’s more, there’s nothing fake about it! Tempeh, traditional to Indonesians and a part of their diet for centuries, has caught the imagination of people globally over the past few years as a meat substitute and is now making inroads into Indian kitchens as well. Copyright©2024 Living Media India Limited. For reprint rights: Syndications Today Add Business Today to Home Screen Home Market BT TV Reels Menu Menu"
},
