[
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/12/maharashtra-new-regulation-requiring-marginalised-students-to-score-75-in-ugpg-to-avail-overseas-scholarship-questioned",
    "title": "Controversy over Maharashtra's 75% UG/PG requirement for overseas scholarships for marginalised students",
    "published_date": "2024-06-12T16:02:25.017Z",
    "author_name": "Lovely Majumdar",
    "author_url": "https://www.edexlive.com/author/lovely-majumdar",
    "article_content": "The overseas scholarships allocated for the Scheduled Caste (SC), Other Backward Class (OBC), and Scheduled Tribe (ST) students by the Government of Maharashtra are currently under scrutiny. This is due to the government setting the minimum qualifying percentage for the scholarships at 75%, in contrast to the central and other state governments, which have set the cut-off at 55% to 60% Government regulation sets a minimum cut-off at 75% The Rajarshi Shahu Maharaj Scholarship Scheme for students provides financial assistance to SC and Neo-Buddhist boys and girls to pursue masters' and research courses (PhD) abroad. As per a government regulation (GR) released this year, 2024, \"A student admitted to a Master's degree course abroad must have passed the degree examination with at least 75% marks from a recognised university in India.\" This applies to PhD students as well. According to Raju Kendre ( @RajuKendree on X ), a social entrepreneur who works at the grassroots level for the marginalised, the contention with the decree is its exclusionary nature. Speaking to EdexLive he further adds, \"If someone is already admitted to top-tier universities, criteria like this can gatekeep opportunities for students from marginalised communities. This reflects the elite-centric, meritocratic approach of the Indian education system.\" The overseas scholarship for SC & OBC students by the Maharashtra government is a great step, but the recent regulation requiring 75% in UG/PG is exclusionary. Many deserving state university students will miss out. An immediate revision is needed to ensure all aspiring scholars… Marks are important? \"How can the government decide merit based on marks when the grading system is different in different colleges in Maharashtra,\" said Deepak Chatap, an advocate with the Nagpur Bench of the Bombay High Court. He further calls this decision arbitrary and unreasonable, especially as it places the condition of merit on a student's dream. As per Deepak, foreign universities already have a designated criterion for merit, where they expect the student to score a minimum of 60 per cent marks. He questions if these students already secure admissions to these universities, then why another criterion, similar in nature, is additionally imposed by the government? Deepak is a former Chevening scholar and a SOAS London alumni. He says that the scholarship made it viable for him to earn his degree without any hurdles as scholarships such as Erasmus Mundus, Chevening, and Commonwealth allot a full scholarship, where they examine students on the basis of their work experience, leadership and other networking abilities, career plans and so on. Dismissing the grounds of exam scores being the ultimate scale to judge a student's ability, he adds that the state and central governments must look into the student's portfolio and other determining factors such as their ambition, aspirations, and contribution to their field of interest, rather than judging them based on marks. \"This is an act of prejudice and discrimination when a student especially from a marginalised community has to prove his merit via marks,\" emphasises Deepak. Policy to further corner the marginalised? Raju Kendre is the founder of Eklavya India Foundation which empowers students from such communities by mentoring them to gain admission to prestigious colleges and universities in India and abroad. On the increase in cut-offs, he says that it has inadvertently affected the scholars. \"Under our Eklavya Global Scholars Program, a year-long mentorship programme, more than 30 students have already received offers from many top global universities featuring in the top 100 of QS World University Rankings. But due to this 75% policy, they are now stressed,\" Kendre explains about how the announcement affected Eklavya scholars. Critiquing the absurdities of education policies in India, Kendre adds that such policies are ultimately planned and implemented in a way that does not focus on serving the marginalised. Kendre further calls these students assets who can serve as beacons for their community and increase their representation. However, he says that they are merely rendered as meagre subjects for the government's myriad schemes designed for their \"empowerment\". Education, a play-thing for the government? \"Don't treat these students just as financial aid beneficiaries; they are tomorrow's leaders. Treat them as global scholars, like those supported by platforms such as Rhodes, Fulbright, Chevening, DAAD, and Commonwealth. These scholars are the future assets of our nation. Ultimately, we should invest in this human resource,\" says Kendre, a former recipient of the prestigious Chevening scholarship, which allowed him to pursue his Master's in Development Studies at the School of Oriental and African Studies (SOAS), University of London. These scholarships are granted annually to 75 SC, 40 ST ,75 OBC students, and are quite crucial for bridging the lack of representation of these communities in spaces such as law, media, policy, bureaucracy, development, art and culture, asserts Kendre. On the importance of these scholarships for a reserved category student, he says that students who cannot afford such an education vie for these scholarships, as it grants them an exposure that is otherwise amiss from the Indian academia, due to a prevalent prejudice against reserved category students. \"An abroad education gives them the chance to break free from systemic oppression,\" stated Kendre. Not the end of the problem Recipients of the National Overseas Scholarship (NOS) also have to face several adversities despite receiving these scholarships. Kendre, whose organisation mentors several individuals every year, says that students find themselves in a quagmire when they struggle to meet basic daily needs, and often have to do part-time jobs, and cut back on food, networking and so on, to make ends meet. He further states that these scholarships are rarely revised by the government in accordance with the rate of inflation every year, whereas, scholarships provided abroad function as per the market regulations. \"Scholarships such as Felix, Chevening, and Commonwealth pay approximately £19,000 for living costs (revised for inflation every year), but the NOS for SC/ST students provides less than £10,000.\" He also claims that instead of focusing on increasing the number of students and the amount of scholarships, the central and state governments are further limiting them. Netizens did not welcome the move Professor Ravikant Kisana aka Buffalo Intellectual ( @ProfRavikantK ), an academician and a vocal advocator for the rights of the marginalised, questions the logic behind this via a post on social media platform X. Bringing forth the issue of lingering discriminatory stances shown towards marginalised students in academic spaces, he says that these students suffer great disadvantage as casteist teachers regularly control marks to punish students and this would give them more power to assert their control over these students. why has Maharashtra govt made 75% mandatory for SC OBC students overseas scholarship? Where casteist teachers regularly control marks to punish students, this will just give them more power! Also, how was 75% decided? Why not 77%? What is policy logic? Is this arbitrary? https://t.co/SqVP57d2e9 Given that these marginalised students suffer from a lack of resources, Ravikant Kisana exclaims, via his tweet, that first-generation SC/ST/OBC learners from state boards and zilla parishad schools, cannot complete education due to economic and social hindrances, and now, the new 75% rule is further crippling their wings when it comes to choosing to pursue academics abroad. for 1st gen SC ST OBC students in state board/zila parishad schools, finishing college is itself a BIG step. Often they need to do jobs & support family, grades r secondary! new 75% cutoff rule by Maharshtra Govt scholarship basically punishes such students for their precarity! https://t.co/u3qECdASfk The response was made in reply to a user's comment named Rahul Patil ( @iRahul23 ), who says that this may crush students' dreams as even with offers from top universities, many will not be able to afford the education without sufficient scholarships. He reiterates Prof Kisana's claim that in a casteist academic environment, scoring more than 60% is a painstaking task. Will this be an end to the dreams and aspirations of many? What do you think of this imposition, let us know in the comment box below. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/19/after-neet-ug-row-nta-under-fire-for-mismanagement-of-ugc-net-june-2024-exam",
    "title": "NTA faces backlash over mismanagement of UGC NET June 2024 exam",
    "published_date": "2024-06-19T13:06:59.740Z",
    "author_name": "Lovely Majumdar",
    "author_url": "https://www.edexlive.com/author/lovely-majumdar",
    "article_content": "The University Grants Commission - National Eligibility Test (UGC-NET) 2024 June exam was conducted by the National Testing Agency (NTA) yesterday, Tuesday, June 18, all across the country. Despite the UGC Chairman, M Jagadesh Kumar's declaration of successfully conducting the exam, students complained of mismanagement and the various ways in which they were inconvenienced. This time, the NTA conducted the exam in one day, with two shifts. The first shift of the exam commenced at 9.30 am and concluded at 12.30 pm. The second shift was conducted from 3 pm to 6 pm. Absurd allotment of centres? Loni Ahmed Das, a former student of Media Studies at the University of Hyderabad, told EdexLive that the haphazard allotment of centres was bothersome and caused great difficulty. \"I am not a permanent resident here, and navigating through remote areas to reach the centre becomes an arduous task,\" said Loni. Loni, residing in Hyderabad, had to travel 45 kilometres availing different modes of transportation to reach her centre. She tweets: (My centre was around 45 kms away. Taking a combination of bus, auto and metro cost me 600 rupees only to reach the centre. All the candidates had to pay 20 rupees each to keep their bags in a locker room. A direct Uber costs 1500 rupees. Who is the exam for?) - @LonelyNahiLoni 1. My centre was around 45 kms away. Taking a combination of bus, auto and metro cost me 600 rupees only to reach the centre. All the candidates had to pay 20 rupees each to keep their bags in a locker room. A direct Uber costs 1500 rupees. Who is the exam for?2 She further narrated her distress to EdexLive saying that most people couldn't help her with the directions and Google Maps was not accurate either. \"I do not speak the local language and reaching the centre at the stipulated time was close to a challenge for me.\" For Sanjib Kalita, another UGC-NET aspirant, things were not quite easy. Sanjib, a resident of Assam, had chosen Guwahati as his exam centre and had to travel for four hours. \"The only convenient centre for me was Guwahati. UGC has designated centres in just six cities of Assam, and most are in Guwahati and the Northern part of Assam,\" said Kalita. Kalita describes his dilemma and uncertainties when it came to travelling while the state was grappling with heavy rainfall and floods. He cited transportation issues to reach his centre in Guwahati. According to a report by The New Indian Express , over 1.61 lakh people in 15 districts have been affected by the calamity and the flood has claimed 26 lives in the state so far. Centre lacking facilities Das' centre for the UGC-NET June 2024 exam, was an institution named Princeton Institute of Engineering and Technology for Women, where allegedly, they were levied a charge of Rs 20 from the candidates, to keep their belongings in a locker room. According to her, students were not allowed bathroom breaks and the ladies' washroom lacked running water. Furthermore, she alleges that the sinks were broken. Sanjib, adding to this, told EdexLive that the management staff at his centre were not allowing students to keep their belongings on the premises. After several requests, especially from students who travelled from far away places, it was allowed but they also warned that the authority would claim no responsibility for it. \"We have travelled so far, how can we not carry our belongings with us? For students like me, we ought to carry a bag, not all of us have our parents travelling with us or have cars,\" said Sanjib. He further complained of no provision of water at the centre. The Assam resident was not allowed to bring along his water bottle. i think NTA is one of the worst things that has happened to the indian education system. today was NTA's first attempt at organizing the NET examination offline, and everything was so poorly managed at the center that it had us in a panic before even entering the exam hall An X user named Madhushree Goswami posted that her sister-in-law, who is pregnant, had to climb four floors to avail a functioning toilet at her centre. She writes, \"My sister-in-law who is pregnant had to climb up 4 floors to use a 'decent' toilet. The one situated on her floor looked like it was last cleaned ages ago. She was made to sit in such a place which was far away from the fan and there was no proper ventilation, in this heat.\" - ( @Madhushree24 ) My sister-in -law who is pregnant had to climb up 4 floors to use a 'decent' toilet. The one situated on her floor looked like it was last cleaned ages ago. She was made to sit in such a place which was far away from the fan and there was no proper ventilation, in this heat. https://t.co/GKGYeaURIN Pen, paper and more This time, the UGC had reinstated the pen and paper method, replacing the computerised tests. Students, including Kalita, thought that this would be convenient given the glitches that occur with online exams, yet he says that this turned out to be a cause of anxiety for many including him. \"The invigilators in the exam hall had no clue if one could correct their mistakes made on the OMR sheet. One invigilator at our exam centre declared that the student's paper may stand cancelled if they filled in their roll numbers incorrectly, or they tried to fix the mistakes,\" he claimed. He further adds that in a computerised test, one can revise their answer, but on an OMR sheet, it is not possible. Another UGC-NET aspirant from Hyderabad, Nishi, describes her ordeal as anxiety-inducing. \"I was running out of time towards the end, and it filled me with panic. I might have left many questions unanswered, if for the extra few minutes that one luckily got as the invigilators were busy collecting the sheets from other students.\" Do you have your experiences to share with EdexLive? Drop a comment and start a dialogue. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/breaking/2024/Jun/19/in-light-of-cancellation-of-ugc-net-june-2024-session-scholars-look-at-whats-going-wrong-exam",
    "title": "UGC-NET June 2024 Exam Cancellation Sparks Debate on Exam Standards and Relevance",
    "published_date": "2024-06-19T18:14:04.403Z",
    "author_name": "Lovely Majumdar",
    "author_url": "https://www.edexlive.com/author/lovely-majumdar",
    "article_content": "The Ministry of Education announced that the UGC-NET June 2024 exam has been cancelled. While it comes as a surprise for many, experts feel that a problem has been brewing with the exam itself. The new guidelines On March 27, 2024, the University Grants Commission (UGC) Chairman, M Jagadesh Kumar, declared that the National Eligibility Test (NET) scores can now be used for admission to PhD programmes in place of entrance tests by different universities and Higher Educational Institutions (HEIs). Defining its purpose, the notice read, \"To help the students with one national entrance test for PhD admissions as a part of implementing the National Education Policy 2020, the UGC constituted an expert committee to review the provisions of the National Eligibility Test (NET).\" Considering the ongoing barrage of criticism directed at the National Testing Agency (NTA) which conducted the controversy-ridden National Eligibility and Entrance Test - Undergraduate (NEET-UG) and also oversaw the June session of the UGC-NET 2024, was this change welcomed by academicians and aspirants? Antara Chakrabarty, a fourth-year sociology PhD scholar at South Asian University (SAU), shared with EdexLive that there was a strong expectation that the question paper would be conceptual and research-oriented this time. However, it turned out to be rather disappointing. She further contended that the whole idea of the exam is dismissed as it fails to check: Research and writing capabilities, does it measure it correctly? As per Chakrabarty, PhD largely involves producing a thesis and research publications, she questions whether an ill-researched student would be able to get a free pass if they qualify for the NET examination, or a qualified candidate would be denied their proper place due to low scores. She also adds that due to these MCQ (Multiple Choice Question) eligibility tests, and no proper training in research, there is a rise in paid research proposal writing. \"PhD is a personal venture giving a choice to the researcher to choose what they can work on, but now, scoring a particular score would add unnecessary pressure on students who may be lacking in privilege,\" said Antara. Can this deteriorating standard be able to effectively judge students? Chakrabarty opines that the subject matter of the questions has gone down over the years. Stating the change in its pattern, from essay-type questions to MCQs, and the merging of Paper I and Paper II since December 2018 — she contends that the pattern had a standard to it. However, she states that in recent years, the paper started copying the Union Public Service Commission (UPSC) pattern of code-based answers, which may prove problematic in a few cases. Chakrabarty, who has more than two years of experience in mentoring UGC-NET students, says that the questions recently are \"unrelated\" and have no \"underlying value\". \"For instance, the June 2024 Sociology paper was filled with chronology-based questions on thinkers and books. Which peripheral theorist wrote which book in which year — how is it relevant for the student? More so, the Political Science paper was filled with unnecessary chronology-based questions on the Chief Justices of India (CJI). It seems like the questions were made by people who are not in touch with how and what needs to be seen while assessing pivotal capabilities which are essential,\" said the scholar. Exam only for a few, and not for all? Drawing attention to a lesser-discussed point, Chakrabarty contends that the questions were copied from textbooks followed in the United States of America (USA) and the United Kingdom (UK). She further told EdexLive that English medium students would fail to answer them if they didn't memorise it. For students from other vernacular mediums, she questions if they would be able to answer questions that they have absolutely no idea about. She asserted, \"Students from vernacular mediums, no matter how well they understand the subject or have read it, cannot answer such questions. There are no translated versions of these books. The question makers are insensitive towards the language barrier. Are only English medium students now fit to do PhDs or get bare minimum funds during PhD in the name of Junior Research Fellowship (JRF)?\" The advent of rote learning and a copy-paste culture? Emphasising the impracticality of the questions, Antara alleges that the sociology questions were copied from textbooks that are followed in countries like the USA and the UK. She says that these questions cannot be answered by anyone if they haven't memorised them. Commenting on the redundancy of the MCQ culture and the falling standard of the questions, she said that the 'academia chain' would see a downgrading. This would also fuel a coaching culture, and research would be rendered dormant, with no individual thinking and researchers with no basic knowledge or skills. Why do students who have already passed the exam need to re-appear? For Loni Ahmed Das, a former student of the University of Hyderabad (UoH) and belonging to a marginalised section of the society, procuring a Junior Research Fellow (JRF) was a milestone achieved. She qualified for it in the year 2023, and her scores will be valid for the next three years since the year of qualification. However, she cannot avail the fellowship unless enrolled at an HEI or a university, and has a new, valid, UGC-NET score. The recent changes have certainly crippled her prospects as she had to re-appear for UGC-NET despite qualifying it in 2023. \"Previously, central universities had their examinations, but UoH is now accepting UGC-NET scores. Not only is the autonomy of the university dead, but prospects of scholars like us have also dimmed,\" expresses an irate Loni. Prevailing confusion For Nishi, an aspirant, other sets of problems crept in while she appeared for the UGC-NET June 2024 session. Not only does she have no idea what scores shall be deemed acceptable by universities, but only students with high JRF scores will be summoned for admission. She calls this \"highly exclusionary and unfair\", given that students, even if they qualified for UGC-NET, might not get a chance to enroll in PhD courses, especially at central universities and other renowned universities as there might be higher competition. \"NET exams are now like a gamble. It seems like one doesn't need in-depth knowledge to crack it,\" expresses Nishi. What do you think about the NET exam being nothing but a gamble? Let us know in the comments section. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/anatomy-of-paper-leaks-decoding-how-cyber-threats-can-compromise-exams-and-how-this-can-be-avoided",
    "title": "Preventing Cyber Threats in Exams: Anatomy of Paper Leaks and How to Avoid Compromise",
    "published_date": "2024-06-22T11:14:24.356Z",
    "author_name": "Lovely Majumdar",
    "author_url": "https://www.edexlive.com/author/lovely-majumdar",
    "article_content": "On June 19, 2024, the Ministry of Education declared the nullification of the University Grants Commission - National Eligibility Test (UGC-NET), 2024, June cycle. \"The Ministry of Education has decided that the UGC-NET June 2024 Examination be cancelled based on inputs from Indian Cyber Crime Coordination Centre (I4C) under the Ministry of Home Affairs, prima-facie indicating that the integrity of the examination may have been compromised,\" read the press release. A system that was already dwindling, with allegations of paper leaks and scams against the National Eligibility and Entrance Test - Undergraduate (NEET-UG), bore a final brunt with the dissolution of the UGC-NET exam. Taken by over 9,00,000 candidates across 317 cities and serving as the qualifying exam for admission to PhD programmes and for applying to entry-level teaching positions at Indian universities, the news left students highly inconvenienced. Perils of cybercrime It cannot be said that government bodies have been immune to severe data breaches. In 2023, the personal details of over 815 million Indians were leaked from the online repository of the Indian Council of Medical Research. Later that year, the Hindustan Times reported a malware attack on the cybersecurity systems of the All-India Institute of Medical Sciences (AIIMS) in New Delhi, compromising various information and personal details of patients. With technological advancements, cybercrime has gained momentum, leading to more severe security breaches over time. Professor Aman Gupta, an Assistant Professor at the National University of Juridical Sciences (NUJS), Kolkata, told EdexLive that when technology goes unchecked and untethered, the process of gaining access to these domains of information can be performed surreptitiously. Prof Gupta says that access can be gained through various ways, such as bugs, vulnerabilities in software, or via viruses, spyware, or malware, as it happened with the previous cyber attacks. \"One possible way is data breach due to unauthorised access to the computer, website, or networks on which the sensitive examination data, such as the question papers, answer keys or results, are stored. The criminals can then download, modify, and/or delete the information,\" said Gupta. Not only this, he suggests that there are ways in which the exam process can be tampered with. Cybercriminals have various malicious methods to interfere with an examinee's process. According to Gupta, denial-of-service (DoS) and distributed denial-of-service (DDoS) attacks are more likely to occur during an examination, which can disrupt the services of the website host by sending unnecessary requests or invalid data, which can indelibly lead to stunted performance of the service provider's server. This might mean that the answers chosen by the aspirants may not get recorded on the server within time. Easy to get access? The National Testing Agency (NTA) has established itself as a premier autonomous body conducting several significant examinations such as the Joint Entrance Examinations (JEE), Common University Entrance Test (CUET), NEET, UGC NET and others. Set up in 2017, the agenda was to centralise these entrance exams, under the ambit of the National Education Policy (NEP) 2020, with the goal of a 'One Nation-One Test'. Given NTA's vast functional machinery, to what extent can it be held accountable for its mismanagement? Founder of Cyber Jagrithi, Rupesh Mittal says that there are ways in which NTA can be held accountable for such negligence but it should be known that the body does not itself conduct examinations. \"NTA relegates the duties to third parties like TCS iON who conducts these online examinations for the NTA,\" he said. However, he adds that the NTA could be held accountable for failing to ensure security posturing, which encompasses performing a check into the security status of software and hardware assets, networks, services, and other information. \"When such duties are outsourced, sometimes due to negligence, lax measures or outdated software, the system becomes vulnerable to cyber attacks,\" said Mittal. He further told EdexLive , that apart from security posturing, there should be checks on how the data is moving from one source to another. \"There must be prevention systems, where one can identify whether the information is channelled through trusted systems or going to an unknown external destination,\" explained the cyber security expert. Applications such as Intrusion Detection Systems (IDS) and Intrusion Prevention Systems (IPS) serve as barriers that detect and exterminate such external attacks. The absence of stringent checks such as IDS and IPS may result in a major server breach, resulting in data leaks. Hence, maintaining cyber hygiene and updating systems are quite important, he said. Rupesh Mittal further laid emphasis on the importance of system configuration and software upgradation as such practices maintain overall cyber hygiene. For that, he says, updating the software is of paramount importance. \"One must have seen that we receive software updates on our phones. Why does it ask us to do so? To protect our phone's system from new vulnerabilities. Developing software is not a day's job, it takes time. Systems need to be configured accordingly and versions need to be upgraded or else, these systems will fall victim to such threats,\" asserts Mittal. He expressed that this may become a greater threat if the criminal has information about the loophole, further making it easier for them to weaponise their source. Pen and paper method, a solution to such cyber leaks? According to a report by EdexLive , the case of the NEET-UG paper leak, which is now being investigated by a Special Investigation Team (SIT) of the Bihar Economic Offences Unit (EOU), there were suggestive pieces of evidence of the leak, being orchestrated by an organised gang. Although the online exam is considered to be a safer mode, cyber expert Rupesh Mittal suggests that it can also be prone to leaks, like that of the UGC-NET examination. He told EdexLive that, even if an exam is conducted offline, with strict vigilance, the blueprint of the original paper(s) will certainly be reproduced in a digital format as well. To this, he adds, \"We do not live in the typewriter age anymore. These question papers, even if highly confidential, ultimately are stored or transferred via software or digital platforms, and are available digitally. Technology can have its benefits but even if there is negligence in security, leaks can happen. How? One cannot estimate unless the matter is investigated.\" Mittal also stated that because students' identities and roll numbers are stored digitally and results are published online, a cybercriminal with access could potentially alter or tamper with this information. He emphasised that while this is a possibility, it is not a certain answer to the successive leaks that took place. Can this be avoided? While information security practices are vigorously publicised by the government, cyber law expert Aman Gupta is of the notion that the National Testing Agency (NTA) must also be practising it as well. \"The Indian Computer Emergency Response Team, (CERT-iN) has published the guidelines on information security practices for government entities, which provide best practices to be followed, to prevent cyber threats. Examination conducting bodies should be aware of this and implement the same,\" he commented. Rupesh Mittal says that it is imperative for these government bodies and their associated agencies to organise routine Information Technology (IT) audits to ensure data integrity and a security check on the systems, through Vulnerability Penetration and Assessment Testing (VAPT). Via this method, it would be revealed whether a system is prone to breach and if attacks can be prevented in the future. Although the Public Examinations (Prevention of Unfair Means) Act, of 2024, criminalises unfair means in examinations, the NUJS professor says that crime will no longer remain localised as information can be accessed from anywhere. Hence, he suggests that significant coordination is needed between testing bodies, investigative and enforcement agencies, and Central and state governments to prevent such incidents before the examination, rather than responding afterwards. Adarsh Sudhindra, Vice-President of Growth and Strategy at Excelsoft Technologies, similarly emphasised that robust security measures should be implemented to ensure all staff and administrator activities are logged and audited regularly. Additionally, staff must be educated to recognise potential cyber threats, such as phishing. How to assuage students? The turbulence that students faced when the integrity of two major examinations was compromised led to a decline in faith within the system. What can the National Testing Agency or any other government body do to instil the trust? Prof Gupta is supportive of the fact that certain untoward situations can be avoided when there is purported news of intrusion. \"Canceling the exam at an early stage is a better outcome for the candidates. It allows for clarity and removes concerns that the examination's validity may be challenged later and reduces the impact on individuals who had relied on the results for admissions or jobs,\" said he. According to a report by NDTV Education , in the year 2015, the All India Pre-Medical Test (AIPMT), the former national-level medical entrance test conducted by the Central Board of Secondary Education (CBSE) was cancelled due to an alleged paper leak. A verdict by the Supreme Court followed that incident, where CBSE was directed to re-conduct the exam and declare the results in four weeks. Apart from this, Dr Lovi Raj Gupta, Pro Vice-Chancellor of Lovely Professional University purports that these examination conducting bodies can provide regular updates and maintain transparent communication about the actions being taken to address the cybercrime incidents. He cited an example of the Australian Tertiary Admissions Centre (ATAR) which regularly communicates with students and public officials through statements, press releases and social media updates, further providing transparent information about any security incidents, actions taken and improvements made to enhance the integrity of exams, and stressed that the National Testing Agency, or any other government body, to maintain its accountability, can do so henceforth. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/May/24/jnu-students-protest-disruption-of-mph-fellowship",
    "title": "JNU students protest disruption of MPH fellowship",
    "published_date": "2024-05-24T15:06:13.720Z",
    "author_name": "Lovely Majumdar",
    "author_url": "https://www.edexlive.com/author/lovely-majumdar",
    "article_content": "A new issue has arisen within the corridors of Jawaharlal Nehru University (JNU), as students from the Master of Public Health (MPH) program under the Centre of Social Medicine and Community Health (CSMCH) allege a cessation of their UGC non-NET fellowship, amounting to ₹5,000 per month. This grievance, echoing for the past 1.5 years, was brought to light by a concerned student in a conversation with EdexLive . The student, Pankaj Mishra, a PhD student from the CSMCH department, shed light on the situation, attributing the issue to administrative changes within the School of Social Sciences (SSS). Mishra highlighted the appointment of Kaushal Kumar Sharma as the new Dean of SSS in 2023, coinciding with the onset of the problem. A social media post by the Jawaharlal Nehru University Students’ Union (JNUSU) read that the turn of events could be accorded to the commencement of the office of the new Dean of SSS. Thereafter, the fellowship was abruptly halted by the administration. “It has become more confusing for the students as there has been no explanation, no orders or notifications issued before the fellowship was revoked. The money that they could have used for their expenses for their field research or hostel fees is now being financed by them. It is difficult...” lamented Pankaj, encapsulating the predicament faced by the affected students. Confusion prevails The disbursement of fellowship at JNU has sparked confusion and debate among students and faculty alike. The JNUSU issued a notification raising concerns over the allocation of fellowship funds, particularly for MTech and MPhil students. The JNUSU notification highlights a susceptible reason for the confusion surrounding the disbursement of the fellowship. According to an ordinance issued by the university, the fellowship was originally granted to MTech and MPhil students. However, contention arises regarding the discontinuation of the MPhil program at universities and its implications for granting the fellowship to MTech students. To notify the readers, the MPH course after completion is recognised as equivalent to an MTech course. “Students who have completed their MBBS, BDS and students from humanities apply to this course, although humanities students would be required to complete their masters’ degree before pursuing this. A lot of weightage is given to this course,” said the PhD student who also pursued his MPhil from JNU. The importance of the fellowship in supporting research endeavours at JNU was underscored by Mishra, a student involved in the program. Mishra emphasised the significance of the fellowship, particularly for courses involving six months of extensive fieldwork. “The department has previously contributed to various research areas including Tuberculosis and Polio. The fellowship is important for the development of our research but also for our sustenance,” said Mishra. Dean denies responsibility Members of the JNUSU have constantly denied having any responsibility in this regard. On Tuesday, May 21, the JNUSU, along with the SSS councillors, joined the MPH students to discuss and resolve the issue with the Dean. During the meeting, the Dean repeatedly passed the buck to other administrative sections, further exacerbating the situation. The JNUSU condemned these actions as alleged labelling them as alleged attempts “to strangle academic pursuit by consistently suffocating students into fund crises; to systematically dismantle a department like the CSMCH which provides a progressive look out into the field of social medicine through its rigour and quality of work.” Today, Friday, May 24, about 50-100 MPH students along with JNUSU members and students from other departments confronted the Dean. In response, the administration pledged to convene a meeting with higher officials to reach a consensus regarding fellowship disbursement. “The Dean assured us that we will be given a decision by Monday, May 27, by 4 pm,” said Pankaj, to EdexLive . “The JNUSU members have also called for a hunger strike if the fellowship is not reinstated,” he added. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/08/neet-ug-2024-protests-look-protests-so-far-what-is-to-take-place-this-week",
    "title": "NEET UG 2024 Protests: Chaos Erupts Nationwide Over Exam Irregularities and Paper Leaks",
    "published_date": "2024-06-08T16:15:51.367Z",
    "author_name": "Lovely Majumdar",
    "author_url": "https://www.edexlive.com/author/lovely-majumdar",
    "article_content": "Chaos erupted following the release of the National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) results on June 4, as students and experts accused the National Testing Agency (NTA) of failing to address recurring irregularities in the examination process every year. Additionally, this year’s exam was marred by paper leaks, mismanagement, and the controversial allocation of grace marks, potentially disadvantaging deserving candidates vying for medical college seats. Protests have been raging in the country after experts such as Physicswallah CEO, Alakh Pandey, and other popular personalities such as Tamil Nadu Chief Minister (CM) MK Stalin, Congress Leader Priyanka Gandhi Vadra, Journalist Ravish Kumar, YouTuber Dhruv Rathee and several others amplified the situation. On Friday, June 7, the National Students’ Union of India (NSUI) leaders, including in-charge Kanhaiya Kumar, national president Varun Choudhary, and Congress Secretary Vineet Punia, held a press conference demanding a Supreme Court-monitored investigation into the recent NEET UG examination irregularities. Numerous student protests have erupted nationwide in response to the NEET UG examination issues. Here’s a detailed look at the events that have transpired, and the actions planned for the coming days. June 7 · Students from Kanpur’s Kakadeo organised a protest demanding that NEET counselling should not occur before the SC probe. · NEET students from Lucknow protest against the NTA and demand the cancellation of the NEET (UG) 2024 exam. · According to media reports, students in Ranchi organized a silent protest, holding placards displaying their scores and the message “We Want Justice. · According to media reports, the state NSUI activists staged a protest at the main gate of the Rajasthan University against the discrepancies in the NEET UG results. June 8 · A large cohort of students protest on the streets of Varanasi, Prime Minister Narendra Modi's constituency. · The NSUI Madhya Pradesh members protest against the irregularities in the NEET exam. · The NSUI via ‘X’, asks students and individuals to join their Twitter space at 8 pm to raise voice against the paper leak. June 10 · The Jawaharlal Nehru University Students Union (JNUSU) has called for a demonstration at 10 am at the Ministry of Education, New Delhi. · The All-India Students’ Association (AISA) has called for an “All India Protest Day” against alleging corruption in NTA. · The Students Federation of India (SFI) Delhi, State Committee announced a protest at 10 am, at the Ministry of Education, New Delhi. · Students of West Bengal to organise a protest in Kolkata from Gandhi statue, Dufferin Road to the Metro Channel in Esplanade from 2 pm. June 11 · Students at Uttar Pradesh’s Meerut to organise a protest march from PL Sharma Road to the DM Office from 10 am. The NEET exam took place on May 5 at 4,750 centres in 571 cities, including 14 international locations. Data from NTA indicates that 23,33,297 candidates participated in the NEET 2024 exam. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/campus/2024/Jun/19/how-to-kick-start-your-career-as-a-graphic-designer-after-class-xii",
    "title": "How to kick start your career as a graphic designer after Class XII",
    "published_date": "2024-06-19T03:38:06.434Z",
    "author_name": "Prof Anjan Chakravorty",
    "author_url": "https://www.edexlive.com/author/prof-anjan-chakravorty",
    "article_content": "Transitioning from high school to university involves exciting yet daunting decisions about future careers. In today's era of rapid technological advancement, particularly with artificial intelligence (AI) transforming industries, traditional professions face challenges. However, amidst this disruption, graphic design shines as a field offering limitless opportunities for those passionate about creativity and visual communication. Unlike AI's proficiency in repetitive tasks, human designers contribute intuitive decision-making, emotional resonance, and creative expression. Businesses prioritise digital presence and brand identity, increasing the demand for skilled graphic designers who create compelling content across platforms, influencing global organisational strategies from branding and advertising to UX and interface design. Emerging fields such as motion graphics, Virtual Reality (VR), and interactive media highlight the evolving field of graphic design. For aspiring designers, creativity, innovation, and adaptability are the key steps to being successful. - Begin by introspecting to understand your character traits and hobbies. This helps gauge your suitability for graphic design. - Traits such as attention to detail, creativity, and an appreciation for aesthetics are valuable in this field. - Proficiency in artistic mediums such as drawing, painting, or digital art is beneficial but not mandatory; a willingness to learn is essential. - Enjoying technology and storytelling are also indicators of potential fit for a graphic design career. - Opt for a design school that offers a comprehensive education covering both theoretical knowledge and practical skills. - Look for institutions that foster a culture of experimentation and provide exposure to current industry trends. - Ensure the school supports the development of a robust portfolio through internships, personal projects, and collaborations. - Networking opportunities provided by the institution through workshops, master classes, and industry events are crucial for building connections in the field. - Actively seek feedback to refine your skills and adapt to industry standards. This can be through jury presentations, feedback sessions, or online platforms. - Establishing a professional online presence is vital for showcasing your work beyond college. Platforms like Behance, Instagram, and LinkedIn are valuable for networking with industry professionals and peers. - Embrace constructive criticism to identify areas for improvement and refine your skills accordingly. This adaptability is key to staying competitive in the field. - Graphic design is dynamic and influenced by technological advancements and evolving design trends. - Attend master classes, webinars, and industry conferences to stay abreast of emerging styles, techniques, and mediums. - Experiment with new tools and approaches to keep your creativity fresh and adaptable to changing client demands. - Engage in a variety of projects including personal initiatives, freelance work, internships, and volunteer opportunities. - Showcase your skills across different aspects of graphic design such as branding, typography, illustration, and web design. - A diverse portfolio not only demonstrates your creativity and skills but also shows your versatility to potential employers or clients. - Networking is essential for career growth in graphic design. Build relationships with peers, mentors, and professionals in the industry. - Attend industry events, workshops, and join online forums to expand your professional network. - Networking can lead to collaborations, job opportunities, mentorship, and valuable insights into industry practices. - Proficiency in digital tools and software is fundamental for enhancing creativity and efficiency in graphic design. - Stay updated with advancements in design software and explore new technologies relevant to graphic design. - Experiment with multimedia integration including digital media, motion graphics, virtual reality (VR), and interactive design to broaden your skillset. - Graphic design is a field that continually evolves. Commit to lifelong learning and skill development. - Take advantage of online courses, workshops, and tutorials to expand your knowledge base and stay competitive. - Embrace a curious mindset and remain adaptable to new technologies and design methodologies as they emerge in the industry. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/diabetes-medication-as-drug-therapy-for-sleep-related-disorder-study-shows-potential",
    "title": "Tirzepatide: A Promising Drug Therapy for Obstructive Sleep Apnea Revealed in New Study",
    "published_date": "2024-06-22T10:00:00.000Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "Tirzepatide, known to manage type 2 diabetes, has shown potential as the first effective drug therapy for Obstructive Sleep Apnea (OSA), a new study has proved. OSA is connected with sleep, wherein, the breathing is irregular owing to a complete or partial blockage of the upper airway. Published in the New England Journal of Medicine , the study showed the treatment’s potential to enhance the quality of life for several around the world who are affected by OSA. “This study marks a significant milestone in the treatment of OSA, offering a promising new therapeutic option that addresses both respiratory and metabolic complications,” said Atul Malhotra, MD, lead author of the study, professor at UC San Diego Health, stated a report by IANS . Low blood oxygen level and risk of cardiovascular problems like hypertension and heart failure is what OSA can lead to. Approximately, there are 936 million OSA patients worldwide, research which was led by Malhotra, revealed. This study involved 469 participants who have been diagnosed with clinical obesity and are living with moderate-to-severe OSA. The 469 participants were administered 10 or 15 mg of the drug by injection or placebo and the impact of tirzepatide was noted over 52 weeks. It was noted that breathing interruptions dropped during sleep, which is a key way to measure OSA. A few participants even reached a point where CPAP therapy might not be necessary. It was also noted that the therapy improved other points related to OSA, such as reducing the risk factors of cardiovascular diseases and improving body weight. \"This new drug treatment offers a more accessible alternative for individuals who cannot tolerate or adhere to existing therapies. We believe that the combination of CPAP therapy with weight loss will be optimal for improving cardiometabolic risk and symptoms,\" shared Malhotra. \"This improvement was much greater than what was seen in participants that were given a placebo,\" the study mentioned. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/committee-to-reform-exam-process-to-be-headed-by-former-isro-chairman-k-radhakrishnan-education-ministry",
    "title": "Committee to reform exam process to be headed by former ISRO Chairman K Radhakrishnan: Education Ministry",
    "published_date": "2024-06-22T10:40:07.451Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "Today, June 22, the Ministry of Education (MoE) released a press release through Press Information Bureau (PIB), Delhi, announcing that it constituted a High-Level Committee of experts under the chairmanship of Dr K RadhaKrishnan, the former Chairman of the Indian Space Research Organisation (ISRO) and Chairman of Board of Governors (BoG), Indian Institute of Technology (IIT), Kanpur to ensure fair and transparent conduct of examinations. The release states, \"Committee to make recommendations on Reform in mechanism of examination process, improvement in Data Security protocols and structure and functioning of NTA (National Testing Agency).\" The Union Education Minister, Dharmendra Pradhan, recently announced that a committee will be established to reform the NTA in response to reports of irregularities and paper leaks in two national-level exams conducted by the agency — UGC-NET and NEET-UG 2024. The committee will submit its report to the MoE within two months from, as per the release and make recommendations on the following: Reform to the examination process Improvement of data security standards Structure and operation of the National Testing Agency Here is the list of the other members of the High-Level Committee: Dr Randeep Guleria, the Former Director of All India Institute of Medical Sciences (AIIMS), Delhi Prof B J Rao, Vice-Chancellor of Central University of Hyderabad Prof Ramamurthy K, the Professor Emeritus of the Department of Civil Engineering, IIT Madras Pankaj Bansal, the Co-Founder of the People Strong and Board Member- Karmayogi Bharat Prof Aditya Mittal, Dean of Student Affairs at IIT Delhi Govind Jaiswal, Joint Secretary of MoE, Govt of India © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/maharashtra-man-charged-under-pocso-act-for-forcibly-kissing-mentally-unwell-child",
    "title": "Maharashtra: Man charged under POCSO Act for forcibly kissing mentally unwell child",
    "published_date": "2024-06-22T10:42:18.023Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "In Ambernath in the Thane district of Maharashtra, a man was arrested for allegedly forcibly kissing a 14-year-old mentally unwell girl, a police official said today, Saturday, June 22, states a report by PTI. According to the report, the police official identified the accused as Harish Raju Shengal, a 26-year-old man, who has been charged under the Protection of Children from Sexual Offences (POCSO) Act and Indian Penal Code for sexual harassment, use of criminal force against woman and other offences. \"He took the girl to an isolated room near her house in Bhuvapada on June 10 and kissed her forcibly. He touched her inappropriately. Shengal was arrested on the complaint of the victim's mother,\" the Ambernath police station official said, according to the PTI report. In another case from Thane, Yesterday, June 21, a man was sentenced to ten years in prison for luring and raping a five-year-old child in a toilet on November 24, 2018. The 24-year-old man, Murali Kanhaiyalal Chouhan, was not only sentenced to ten years in prison under the POCSO Act but also fined Rs 50,0000, states a PTI report. Another 60-year-old was also booked under the POCSO Act in the last 24 hours for misbehaving with a minor in Sultanabad, Telangana. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/bomb-threats-delhi-police-to-expand-bomb-detection-disposal-and-dog-squads-amid-surge-in-hoax-calls",
    "title": "Bomb threats: Delhi Police to expand bomb detection, disposal and dog squads amid surge in hoax calls",
    "published_date": "2024-06-22T11:22:33.693Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "After bomb threats over email to schools, hospitals and other establishments in the national capital, the Delhi Police has planned to expand its bomb detection, disposal and dog squads in each of its districts for swift action, official sources said, according to a report by PTI. There are five bomb disposal squads, 18 bomb detection teams and one dog squad with 70 canines for Delhi's 15 police districts. All three units are under the Crime Branch. In the past two months, there have been at least seven instances of hospitals, schools, colleges, museums, railway establishments, prisons and government offices getting bomb threats via email that were sent using virtual private networks (VPN) or proxy servers, states the PTI report. The threats were later found to be hoaxes and are being investigated by the Special Cell. The sources said whenever such a threat is received, the entire machinery of the administration is tasked with sweeping the premises. After the local police, the bomb detection, disposal and dog squads are first responders in such emergencies, they said. But due to the limited resources available with these units, the personnel are overworked and that leads to a higher probability of mishaps, they added. As per PTI, an official source said there is a plan to increase the strength of these squads and setting up dedicated units for each police district of Delhi. This will help the force act swiftly during emergencies, the source said and added that a plan has been drafted and the files sent to the higher authorities for approval. According to the proposal, the bomb detection, disposal and dog squads will be divided with the induction of more personnel. There is a proposal to buy gadgets for bomb detection, disposal as well as bulletproof jackets, reports PTI. The dog squad, which currently has 61 sniffers, six trackers and three for detecting narcotics, may be distributed among each police district. The number of dogs and handlers will also be increased if the proposal is approved, the sources said. According to official data, the Delhi Police's dog squad has 27 labrador retrievers, 18 Belgian shepherds (malinois), 16 German shepherds, and nine golden retrievers aged between six and nine months, states PTI. On average, each dog serves the force for around nine years, after which they are handed over to non-government organisations following their retirement, an officer said. There are dedicated dog squad units at a few locations but the police's plan proposes to set up units in its Shahdara, South, Rohini, Southeast, Outer, Outernorth, Northeast and Dwarka districts, the official source said, states PTI. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/neet-ug-2024-paper-leak-bihar-police-claims-to-have-retrieved-reference-question-papers",
    "title": "NEET-UG 2024 paper leak: Bihar police claims to have retrieved reference question papers",
    "published_date": "2024-06-22T11:28:42.245Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "Today, Saturday, June 22. the Bihar Police's Economic Offences Unit (EOU), which is investigating the alleged National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) 2024 paper leak case, claimed to have acquired reference question papers of the test conducted by the National Testing Agency (NTA) and planned to compare these with documents retrieved from a flat in Patna during a search operation last month, reports PTI . According to the report, state police sources said that the EOU is also exploring the \"possibility of conducting narco analysis and brain mapping tests\" of some arrested accused in the case. Additionally, they hinted that the Enforcement Directorate would look into the money laundering component of the alleged irregularities in the NEET-UG, a medical admission exam conducted by the NTA in May. \"We had requested the NTA for the reference question papers after we began the probe last month. Finally, they did the needful. We will tally these papers with partially burnt papers seized from a Patna flat last month. This exercise is likely to be done before a forensic examination of such documents,\" an EOU source said, reports PTI . As per PTI, top officials of the EOU are likely to visit Delhi on Saturday to \"discuss certain aspects pertaining to the ongoing probe with the senior officials of the Union Education Ministry and other concerned wings\", he said. \"Based on EOU's FIR, the Enforcement Directorate may probe the matter under the relevant sections of the Prevention of Money Laundering Act (PMLA). The central agency is expected to identify proceeds of crime and initiate proceedings to attach properties belonging to the accused or suspects,\" said another source of the Economic Offences Unit. Commenting on this, Abhayanand, former director general of police (DGP), Bihar, told PTI , “There is no doubt that grave offences have been committed in the NEET-UG 2024 exam. Prima facie, it appears that the paper was leaked…evidence collected so far is also suggestive of the paper leak. The case must be probed under the provisions of the PMLA as black money is involved in it.\" It is also learnt that certain arrested accused in the case are \"providing conflicting statements or changing their statements during interrogation\", the EOU sources said, states PTI . \"Investigators are not satisfied with the statements of certain accused. Although they have been questioned several times, their replies are not convincing. Now officials are contemplating conducting brain mapping and narco-analysis tests. These scientific tests may provide certain fresh leads to investigators,\" one of the EOU sources said. Thirteen people were detained by the EOU last month when it investigated the alleged NEET-UG 2024 exam paper leak. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/neet-ug-2024-paper-leak-row-bihar-police-detains-six-near-aiims-deoghar",
    "title": "NEET-UG 2024 paper leak row: Bihar police detains six near AIIMS Deoghar",
    "published_date": "2024-06-22T11:30:47.197Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "According to an official, today, Saturday, June 22, six people from Jharkhand's Deoghar district were arrested by the Bihar Police in connection with the alleged irregularities and paper leak in the medical entrance exam National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) 2024, states a report by PTI . As per the report, these six individuals were detained from a house near All India Institute of Medical Sciences (AIIMS) Deoghar in Devipur police station area on Friday, June 21, night, the official informed. \"The Bihar Police gave us a tip-off. On our identification, they were taken into custody. All the suspects have been taken to Bihar,\" Sub-Divisional Police Officer (SDPO) (Deoghar Sadar) Ritvik Srivastava told PTI. The suspects were allegedly living at the house of one Jhunu Singh, he said. According to a statement released by the Deoghar Police, they were named Paramjit Singh alias Bittu, Chintu alias Baldev Kumar, Kaju alias Prashant Kumar, Ajit Kumar, Rajiv Kumar alias Karu, and Panku Kumar, all of whom were residents of the Nalanda district of Bihar. The NEET-UG examination, held on May 5 across 4,750 centres, saw participation from approximately 24 lakh candidates. Results were announced earlier than expected on June 4, leading to suspicions of irregularities, especially after 67 students scored a perfect 720 – an unprecedented occurrence in the National Testing Agency's (NTA) history. Notably, six of these top scorers were from a single centre in Faridabad, Haryana, raising further doubts about the integrity of the exam, reports PTI . © edexlive 2024"
}
]