[
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/14/calcutta-hc-to-hear-petitions-on-neet-ug-2024-grace-marks-issue-at-2-pm-today",
    "title": "Calcutta High Court to Hear Petitions on NEET UG 2024 Grace Marks Issue Today at 2 pm",
    "published_date": "2024-06-14T06:54:57.510Z",
    "author_name": "Harsha Tallapragada",
    "author_url": "https://www.edexlive.com/author/harsha-tallapragada",
    "article_content": "After Supreme Court, the Calcutta High Court (HC) is going to hear a petition about the grace marks matter of the National Eligibility cum Entrance Test Undergraduate (NEET UG) 2024 exam today, June 14. On June 13, the apex court order stated that the Union Government had decided to withdraw the grace marks given to the 1,563 candidates and give the option of re-test to them. Challenging this, Advocate Tanmoy Chattopadhyay has approached the Calcutta HC and the hearing is scheduled to be heard at 2 pm today, June 14. Speaking to EdexLive, he said, \"The matter was mentioned in front of the divisional bench presided over by Justice Harish Tandon on June 13 and the justice was pleased to allow this matter to be listed before the chief justice of the divisional bench. However, last night we were made aware that the matter was assigned back to the divisional bench headed by Justice Tandon.\" Referring to the apex court order, advocate Chattopadhyay opines, \"Chances are few as the apex court's order states that the grace marks petition has been closed. Under such circumstances, it will be very difficult to plead anything that would be contradictory to the SC's decision.\" However, since it is not a conclusion, we will put forth our representations, he added. \"These 1,563 candidates will be positioned differently. However, what about the other candidates who were unable to appear before the high court during the results declaration to submit a writ petition or representation?\" he questioned. To recall, the test conducting agency, the National Testing Agency (NTA), had awarded 1,563 candidates with grace marks. In a statement issued by the agency, it said that upon receiving several representations regarding the loss of exam time, the agency has decided to award students with grace marks. This move was criticised by experts for being arbitrary. With regards to the same, three petitions were heard by the apex court on June 13. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/14/shocked-disheartened-sad-iijnm-alumni-react-news-journalism-schools-closure",
    "title": "IIJNM Alumni Express Shock, Disheartenment and Sadness Over School's Closure",
    "published_date": "2024-06-14T16:45:32.341Z",
    "author_name": "Harsha Tallapragada",
    "author_url": "https://www.edexlive.com/author/harsha-tallapragada",
    "article_content": "\"Shocked\", \"disheartened\" and \"sad\" were the three adjectives students of the Indian Institute of Journalism and New Media (IIJNM) near Bengaluru used while expressing their profound sadness regarding the closing down of the institute. One of India's most renowned Journalism schools has closed its doors. Whether it is for this academic year or otherwise is the question on everyone's mind. \"We were all rather taken aback. At IIJNM, the first lesson we learned was to double-check the news. Thus, even after learning about the situation, we weren't certain if it was real or a prank. We were informed by the faculty of the administration that the institution is not closing down permanently and that the decline in admissions this year is the only reason that they are shutting down for this year,\" said Snehi Shah, a student of batch 2022. Similarly, students Swalpi Bajpai, Batch of 2019 and Abhishek Sarkar, Batch of 2017 said the news was disheartening and sad. \"It is unfortunate for the budding aspirants. Now, what about their future? With its professional experience and unique courses, IIJNM undoubtedly has had an impact on students. The enrolled students will be left behind without any option,\" Sarkar emphasised. Going back to IIJNM Recalling their college days at the institute, the former students shared endearing experiences at IIJNM. Sarkar shares, \"I was enrolled in the ten-month course which felt like a two-year one because we were taught innumerable topics and concepts. With all the assignments, research, contact-building, and networking with officials, IIJNM made us newsroom-ready.\" For Bajpai, IIJNM served as a stepping stone for her career. \"Dean of the institute Kanchan Kaur ma'am is my idol. In addition to many other things, she taught us how to behave, interact with others, stand our ground, and make a point truthfully,\" said Bajpai, who is working as an Associate Producer with India Today . \"The teaching we were given at IIJNM was practical and hands-on. Journalism was taught the way it was supposed to be. For our very first task, we were given general instructions and for the rest, we were encouraged to figure it all out ourselves, for example, how to pursue the story, whom to talk to about it and so on,\" shared Shah, who is now a Business News Anchor at ET Now . Shah, who is originally from Mumbai, stated, \"It was scary and intimidating at first, but IIJNM provided a reality check. We learned that this is how our life will be if we are willing to stay on-ground after being flung into the deep end.\" Bajpai states that she still reads the news first thing in the morning, a habit she picked up at IIJNM. \"We adhered to this practice, which IIJNM had instilled in us. Every day, they used to give the first lecture of the day on what the news of the day was.\" Sorry state of affairs \"The institute opened its doors in 2000 and since then, thousands of students have graduated over 23 batches. Everyone was taken aback, including the staff, professors, and pupils,\" Shah said, adding, \"In India, there aren't many prestigious institutes teaching Journalism. It would be a significant loss for both current and aspiring journalists, if IIJNM were to close completely.\" \"It may be temporary but it is surprising to see an institute like IIJNM going through such issues,\" said a disappointed Shah. According to Bajpai, the world of journalism is volatile, unstable and demands a lot from a person. \"It is necessary to constantly remain on your toes and be available. The work is not 9 am to 5 pm. Nowadays, many choose a simpler path or a 9-5 job. Therefore, the attraction towards this profession has come down,\" she said. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/15/since-april-2023-fmgs-interning-mp-govt-medical-college-allegedly-no-paid-stipends",
    "title": "FMGs allege non-payment of stipends during internships at MP gov't medical college since April 2023",
    "published_date": "2024-06-15T11:56:06.511Z",
    "author_name": "Harsha Tallapragada",
    "author_url": "https://www.edexlive.com/author/harsha-tallapragada",
    "article_content": "On June 14, the All India Medical Students Association - Foreign Medical Graduates (AIMSA - FMG) wing wrote to the Dean of Dr Laxminarayan Pandey Medical College, Ratlam, Madhya Pradesh and urged him to address the issue of non-payment of stipends to the FMGs. In the letter, the students urged the administration to sanction stipends for the interning FMGs currently undergoing the Compulsory Rotating Medical Internship (CRMI). Speaking to EdexLive , Dr Muhammad Tahir, who is a second-year intern at the same college, said, \"After submitting the letter to the dean, we discussed the matter with the administration. However, the response has been unsatisfactory as they said they would sanction the stipends after receiving orders from the Directorate of Medical Education (DME) or National Medical Commission (NMC).\" Today FMGs (intern) requested to the Dean of Dr Laxmi Narayan Pandey Govt.Medical College and Hospital,Ratlam,Madhyapradesh for stipend. We hope the administration will take appropriate steps to provide stipend! pic.twitter.com/2Y1KZjsML7 \"However, the DME and NMC orders instruct the government medical colleges to pay us stipends on par with the Indian medical graduates,\" shared Tahir, who is associated with the AIMSA-FMG wing. According to NMC's notice dated November 22, 2023, regarding clarifications related to FMGs, \"...students at the stage of CRMI, shall be eligible to receive stipend equivalent to the stipend received by IMGs of that college/ Institution.\" Further, he claimed that the affected FMGs, who are around 40 in number, had met the administration more than seven times. \"The administration has been reiterating that it would sanction the stipends only upon receiving orders from DME or NMC,\" a dismayed Tahir added. Sharing his concerns, he said, \"We have to travel to far away rural health centres (RHCs) for internships. Along with the financial burden, we are facing mental strain as well.\" © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/19/icai-ai-integration-centres-of-excellence-expansion-meet-surge-demand-cas",
    "title": "ICAI's Strategic Move: Enhancing Educational Landscape with AI Integration & CoE Expansion",
    "published_date": "2024-06-19T09:19:59.992Z",
    "author_name": "Harsha Tallapragada",
    "author_url": "https://www.edexlive.com/author/harsha-tallapragada",
    "article_content": "Speaking about technological advancements, incorporating AI into ICAI’s framework was part of your roadmap. Could you please elaborate on its implementation and its role in helping CAs, students, and employees? At ICAI, we recognise the transformative potential of AI in enhancing the educational and professional landscape for our members and stakeholders. Implementing AI is not merely about adopting new technology but is a strategic move to streamline operations, optimise learning outcomes, and enhance service delivery within the accountancy profession. Implementation of AI technologies: Our approach to integrating AI involves several key strategies — Automation of Routine Tasks: We are deploying AI systems to automate time-consuming and repetitive administrative tasks. This shift not only improves efficiency but also allows our staff to focus on more complex and value-added activities. Enhanced Data Analytics: AI tools are being utilised to handle large datasets more efficiently, providing actionable insights that can aid in decision-making processes both for our institution and for individual CAs in their professional capacities. Personalised Learning: For our students, AI technologies are set to tailor the educational content to fit individual learning paces and preferences, making the path to becoming a CA more flexible and aligned with personal capabilities and areas for improvement. Role of AI in assisting CAs, students, and employees: For Chartered Accountants: AI enables more sophisticated analysis and forecasting tools that can predict market trends, audit financial statements with higher precision, and provide extensive financial consultations based on deep data insights. These capabilities enhance the advisory roles of CAs, making them indispensable in strategic financial planning. For students: AI in education means adaptive learning systems and automated testing, which facilitates a more customised educational experience. AI-driven analytics can help identify students’ strengths and weaknesses, allowing for a more focused and efficient study process. For employees: As we transition to an AI-enhanced workplace, our focus will also be on upskilling and reskilling our workforce. Training programs are designed not only to help our employees use these new tools effectively but also to ensure they excel in a tech-driven environment. The Committee AI in ICAI has launched ChatGPT — ICAI e-Journal integrating advanced technology with the institute’s journal database. In addition to this, it will soon come out with four more ChatGPT regarding ICAI Acts and Regulations, Digital Accounting and Assurance Regulations, Financial Reporting Review Standards and Ethical Standards. Further, many more are in the pipeline. Additionally, ICAI will soon establish AI labs for research activities. Setting up 11 centres of excellence across the country was in the pipeline. Please elaborate on its progress, the regions where these centres are being established and how are they going to facilitate CA candidates. The Centre of Excellence (CoE) established by the ICAI serves as a hub for advanced learning, research, and development in the field of accounting and finance. At present ICAI has two CoEs at Hyderabad and Jaipur. Further, ICAI plans to open nine more CoEs across the country in the next three years fostering research, innovation and skill-building. It offers specialised training programs, workshops, seminars, and conferences to enhance the skills and knowledge of CAs and accounting professionals. The CoE collaborates with industry experts, academic institutions, and regulatory bodies to ensure that its programs are up-to-date and relevant to the evolving needs of the profession. Recently, the Council approved the policy document on the CoE aiming to foster research, innovation and learning within the accounting profession and position ICAI globally as a thought leader. The policy document outlines the vision, mission, goals, objectives, governing structure, action plan and monitoring benchmark for ICAI—CoE. It also encapsulates efforts to facilitate research, teaching and learning, training, dialogue with stakeholders, and other strategic planning to cultivate talent, conduct advanced research, and disseminate knowledge. How do you think being a CA is perceived today? Is the profession able to keep up with the technological advancements? Chartered Accountants (CA) are often viewed as highly skilled professionals with expert knowledge in auditing, accounting, taxation, finance and business. However, in today’s rapidly evolving business landscape, the role of a CA has expanded beyond traditional accounting tasks. Today’s CAs are involved in strategic planning, business consulting, risk management, and more. This adaptability across various sectors makes them valuable assets, not only in finance or accounting firms but also…. What sets CAs apart is their multidisciplinary approach. They seamlessly blend their financial acumen with insights from diverse fields such as economics, law, and technology to provide holistic solutions to complex business challenges. Whether it's analysing financial data to inform strategic decisions, advising on tax optimisation strategies, or assessing the impact of regulatory changes on business operations, CAs bring a unique perspective that goes beyond numbers. Apart from playing a crucial role in ensuring the financial health of enterprises by driving business efficiency and profitability, CAs also contribute to policy-making processes, tax reforms, and financial regulations, reflecting their importance in shaping the economic and regulatory landscapes of the country. Moreover, being a CA is often associated with financial stability and good earning potential. The profession is known for its lucrative career opportunities. And with their qualifications recognised worldwide, CAs have opportunities globally with diverse career paths. The intellectual nature of the work, diverse career opportunities, and respect in society continue to make CA a highly regarded profession. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/21/icai-president-new-curriculum-exams-three-times-year-emphasis-tech-proficiency",
    "title": "ICAI President discusses new curriculum, exams thrice a year, and tech proficiency focus",
    "published_date": "2024-06-21T00:30:00.000Z",
    "author_name": "Harsha Tallapragada",
    "author_url": "https://www.edexlive.com/author/harsha-tallapragada",
    "article_content": "With the new curriculum implemented on July 1, 2023, aiming to shape accounting professionals in technology, ICAI has been proactive in redesigning its education and training scheme. Could you elaborate on the details of the new curriculum and how it is functioning? Under the new scheme, four self-paced online modules have been introduced which are aligned with technology-enabled learning as advocated by the NEP, 2020. Many new subjects have been introduced under self-paced online modules like paper on Risk Management, Sustainability Reporting, Forex and Treasury Management and Digital Ecosystem and Controls which have prominence worldwide. The new CA curriculum provides requisite competencies through enriched learning methodologies, cogent and holistic skill assessment, effective and focussed practical training, industry orientation and a multi-disciplinary approach which integrates new-age technologies like Artificial Intelligence, Data Science and Blockchain. Accordingly, the new scheme of education and training has been formulated in such a manner to develop global ready chartered accountants. Practical training includes a two-year examination-free period and assessments through case scenario/study-based MCQs at all levels. What's the breakdown of the new scheme and its functioning? Three Levels: The course retains the three-tier structure, Foundation, Intermediate, and Final. There's also the introduction of self-paced online modules for additional learning. Entry Routes: Two entry pathways exist, Foundation Course (for beginners) and Direct Entry Route (for graduates). Tell us about the emphasis on technological proficiency. The new CA curriculum at the final level emphasises technology integration, with Information Technology (IT) and ethics seamlessly woven into core papers. The curriculum incorporates comprehensive training modules under mandatory components of Information Technology and Soft Skills (ICITSS) and Advanced ICITSS. The IT and Advanced IT courses cover an expansive range of topics, including essential software applications such as MS Word, MS PowerPoint, and MS Excel, as well as advanced areas like Data Analytics using CAAT tools such as MS Excel and IDEA. Additionally, students gain proficiency in various accounting packages like ZOHO Books, Oracle Fusion ERP, and Tally, equipping them with practical skills for real-world scenarios. Moreover, the curriculum delves into specialised areas such as Forensic Accounting and Fraud Detection, Digital Forensics, Cyber Security, and Robotic Process Automation. Practical aspects of auditing financial business processes using platforms like Oracle Fusion ERP and Microsoft Dynamics are also explored in depth. Furthermore, students are exposed to data analytical tools like MS Power BI, Python, and Knime, fostering strong analytical and problem-solving abilities alongside their core accounting knowledge. Tell us about the best phased roll-out of new curriculum. The implementation of the new curriculum is phased to ensure a smooth transition for existing students. The inaugural exams under the new scheme will commence in May 2024 for Intermediate and Final level and June 2024 for Foundation level. A significant enrolment of 4,36,246 students has been recorded for the May exams. What about the practical training offered? A two-year examination-free period has been introduced, enabling trainees to fully engage in real-world scenarios uninterrupted. Moreover, mandatory training now starts post-Intermediate level attainment, ensuring students possess a solid foundation before practical training, enhancing their grasp of real-world applications. This shift optimises the benefits and relevance of practical training for students' professional growth. Overall, the new curriculum represents a proactive approach by ICAI to prepare accounting professionals for a tech-driven accounting landscape. By integrating technology into education, ICAI aims to produce graduates proficient in both traditional accounting and tech-driven innovation, enhancing efficiency in accounting practices. On July 1, 2023, ICAI launched its new scheme of education and training, wherein, the syllabus of CA course curriculum was revised after undertaking the comparative study of international accountancy bodies, the requirements under the International Education Standards (IESs) and the significant features of the new National Education Policy, 2020 (NEP) 2020. The new scheme incorporates the good practices adopted by international accountancy bodies. Further, the requirements of IESs have been complied with in one or more subjects at different levels like integration of ethics and technology with core subjects at final level, multi-disciplinary case study at the final level, mixed of descriptive and objective types of papers at Intermediate and final levels. Recently, ICAI has announced to conduct foundation and intermediate exams thrice a year, a move warmly welcomed by candidates who will have more chances to appear for the exam. Considering this move solely applies to only foundation and intermediate exams, can we expect similar amendment for the final exams? Additionally, could you enlighten us on other announcements we can anticipate this year? Globally, the frequency of examinations is higher so that students can get more opportunities to appear for the exam. Bodies like CPA Australia and AICPA allow continuous exams when students are prepared. In order to align with the best global practices and provide more opportunities to students, ICAI has decided to hold Intermediate & Foundation course examinations thrice a year: January, May/June and September, instead of twice. Whereas the CA Final exam will continue to be biannual. This change allows students to appear for the exams every four months instead of six, benefiting those ready to test sooner and encouraging aspiring CAs to pursue their dreams promptly. The decision will benefit the students who have completed their study period to appear in the exam without waiting for two months. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/22/icai-startup-sphere-2024-need-to-know-straight-from-president-ca-ranjeet-agarwal",
    "title": "ICAI Startup Sphere 2024: Uniting Start-ups, Influencers, and Investors for Innovation and Growth",
    "published_date": "2024-06-22T04:00:00.000Z",
    "author_name": "Harsha Tallapragada",
    "author_url": "https://www.edexlive.com/author/harsha-tallapragada",
    "article_content": "What are the main themes and objectives of Startup Sphere 2024? The theme of the Startup Sphere 2024 is Startup Synergy: Collaborate, Create, Conquer along with tech fusion, emerging sectors in start-ups and masterclass on start-ups. The objective of ICAI Startup Sphere 2024 is to create an inclusive and dynamic platform that unites the vibrant startup community, influential partners, promising unicorns, thought-leading influencers, pioneering founders, astute investors, and ambitious entrepreneurs. The event aims to facilitate in-depth discussions on key aspects of the start-up landscape, including governmental support, diverse funding channels, emerging trends, start-up valuation, legal complexities, and best practices in governance. Attendees will benefit from panel discussions on investing in people versus ideas, navigating tax and regulatory advantages, and leveraging digital marketing for growth. Additionally, various sessions will explore the opportunities in Web 3.0, and feature My Journey dialogues with successful entrepreneurs. The event will also highlight the future of fintech, the global impact of Indian start-ups, data privacy, and maximising India's data economy. Complementary activities include a start-up exhibition, dynamic start-up ramp, hackathon, pitch platform, and exclusive investor meet. Furthermore, ICAI Startup Sphere 2024 will offer a customised Campus Placement Programme for experienced Chartered Accountants, providing them with career advancement opportunities in leading organisations and enabling companies to recruit top finance and accounts professionals. How many start-ups are participating this year, and from which sectors? This year, Startup Sphere 2024 is expected to feature participation from over 100 start-ups across a wide range of sunrise sectors, reflecting the event's broad appeal and diverse focus. The sectors represented include technology, healthcare, fintech, EdTech, green energy, and more. In addition to the exhibiting start-ups, the event will host over 100 speakers, more than 50 venture capitalists, and at least seven prominent investors. This diverse and extensive participation underscores the event's significance as a premier platform for innovation, networking, and collaboration within the entrepreneurial ecosystem. What criteria were used to select the start-ups featured in this event? The start-ups featured at Startup Sphere 2024 were selected based on a comprehensive set of criteria designed to identify the most promising and innovative ventures. Key factors included the originality and scalability of their business ideas, market potential, and the strength of their business models. The selection committee also considered the start-ups’ leadership teams, looking for a combination of expertise, vision, and commitment. Additionally, an emphasis was placed on diversity and inclusion, ensuring a wide range of sectors, backgrounds, and perspectives. This rigorous selection process ensures that the event showcases startups with the highest potential for growth and impact, fostering a dynamic and inspiring entrepreneurial environment. What kind of support and resources are being provided to the participating start-ups? Participating start-ups at Startup Sphere 2024 receive extensive support and resources designed to accelerate their growth and development. These include access to mentorship from seasoned entrepreneurs and industry experts, which provides valuable guidance and insights. The event also offers practical workshops and training sessions focused on essential business skills such as fundraising, marketing, and scaling operations. Additionally, start-ups can take advantage of networking opportunities with potential investors and partners, increasing their chances of securing funding and forming strategic alliances. Furthermore, the exposure gained through pitching sessions and innovation showcases can help start-ups attract attention and support from the broader business community. In a significant addition, ICAI is conducting a campus placement during the event specifically for experienced Chartered Accountants, providing start-ups with access to top-tier financial talent to support their growth and operational needs. How can investors and other stakeholders get involved with the start-ups presented here? Investors and other stakeholders can get involved with the start-ups presented at Startup Sphere 2024 through various interactive and networking opportunities provided throughout the event. They can participate in dedicated matchmaking sessions and pitch events where start-ups present their innovative ideas and business models, facilitating direct engagement and investment discussions. Additionally, stakeholders can attend workshops and panel discussions to gain deeper insights into the start-ups’ industries and growth potential. By leveraging these platforms, investors can identify promising ventures, forge strategic partnerships, and contribute to the growth and success of emerging businesses showcased at the event. What steps are being taken to ensure diversity and inclusion among the participating start-ups? To ensure diversity and inclusion among the participating start-ups, Startup Sphere 2024 has implemented several strategic initiatives. The event actively encourages applications from underrepresented groups by partnering with diverse professional organisations and networks. It also features a selection committee focused on evaluating start-ups based on merit while ensuring a diverse range of sectors, backgrounds, and perspectives. Additionally, the event includes panels and workshops dedicated to discussing diversity and inclusion best practices, fostering an environment where all voices are heard and valued. These steps are designed to create a more equitable entrepreneurial landscape and promote innovation through diverse viewpoints and experiences. What are the long-term goals for Startup Sphere, and how does this year’s event contribute to those goals? Indian start-ups can help India achieve Atmanirbhar Bharat by promoting innovation and creating an enabling environment for entrepreneurship in the country. The long-term goals for Startup Sphere include fostering a robust entrepreneurial ecosystem, driving innovation, and promoting sustainable business practices and boosting start-ups that will lead India to become self-reliant. The Startup Sphere 2024 contributes to these goals by bringing together a diverse group of entrepreneurs, investors, industry experts, and thought leaders to share insights and collaborate on emerging trends and challenges. Through keynote sessions, interactive workshops, and networking opportunities, Startup Sphere 2024 aims to equip participants with the knowledge, skills, and connections necessary to drive their ventures forward. By facilitating this exchange of ideas and resources, the event helps build a supportive community that can sustain and accelerate entrepreneurial growth and innovation well into the future. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/campus/2024/Jun/19/how-to-kick-start-your-career-as-a-graphic-designer-after-class-xii",
    "title": "How to kick start your career as a graphic designer after Class XII",
    "published_date": "2024-06-19T03:38:06.434Z",
    "author_name": "Prof Anjan Chakravorty",
    "author_url": "https://www.edexlive.com/author/prof-anjan-chakravorty",
    "article_content": "Transitioning from high school to university involves exciting yet daunting decisions about future careers. In today's era of rapid technological advancement, particularly with artificial intelligence (AI) transforming industries, traditional professions face challenges. However, amidst this disruption, graphic design shines as a field offering limitless opportunities for those passionate about creativity and visual communication. Unlike AI's proficiency in repetitive tasks, human designers contribute intuitive decision-making, emotional resonance, and creative expression. Businesses prioritise digital presence and brand identity, increasing the demand for skilled graphic designers who create compelling content across platforms, influencing global organisational strategies from branding and advertising to UX and interface design. Emerging fields such as motion graphics, Virtual Reality (VR), and interactive media highlight the evolving field of graphic design. For aspiring designers, creativity, innovation, and adaptability are the key steps to being successful. - Begin by introspecting to understand your character traits and hobbies. This helps gauge your suitability for graphic design. - Traits such as attention to detail, creativity, and an appreciation for aesthetics are valuable in this field. - Proficiency in artistic mediums such as drawing, painting, or digital art is beneficial but not mandatory; a willingness to learn is essential. - Enjoying technology and storytelling are also indicators of potential fit for a graphic design career. - Opt for a design school that offers a comprehensive education covering both theoretical knowledge and practical skills. - Look for institutions that foster a culture of experimentation and provide exposure to current industry trends. - Ensure the school supports the development of a robust portfolio through internships, personal projects, and collaborations. - Networking opportunities provided by the institution through workshops, master classes, and industry events are crucial for building connections in the field. - Actively seek feedback to refine your skills and adapt to industry standards. This can be through jury presentations, feedback sessions, or online platforms. - Establishing a professional online presence is vital for showcasing your work beyond college. Platforms like Behance, Instagram, and LinkedIn are valuable for networking with industry professionals and peers. - Embrace constructive criticism to identify areas for improvement and refine your skills accordingly. This adaptability is key to staying competitive in the field. - Graphic design is dynamic and influenced by technological advancements and evolving design trends. - Attend master classes, webinars, and industry conferences to stay abreast of emerging styles, techniques, and mediums. - Experiment with new tools and approaches to keep your creativity fresh and adaptable to changing client demands. - Engage in a variety of projects including personal initiatives, freelance work, internships, and volunteer opportunities. - Showcase your skills across different aspects of graphic design such as branding, typography, illustration, and web design. - A diverse portfolio not only demonstrates your creativity and skills but also shows your versatility to potential employers or clients. - Networking is essential for career growth in graphic design. Build relationships with peers, mentors, and professionals in the industry. - Attend industry events, workshops, and join online forums to expand your professional network. - Networking can lead to collaborations, job opportunities, mentorship, and valuable insights into industry practices. - Proficiency in digital tools and software is fundamental for enhancing creativity and efficiency in graphic design. - Stay updated with advancements in design software and explore new technologies relevant to graphic design. - Experiment with multimedia integration including digital media, motion graphics, virtual reality (VR), and interactive design to broaden your skillset. - Graphic design is a field that continually evolves. Commit to lifelong learning and skill development. - Take advantage of online courses, workshops, and tutorials to expand your knowledge base and stay competitive. - Embrace a curious mindset and remain adaptable to new technologies and design methodologies as they emerge in the industry. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/breaking/2024/Jun/24/neet-ug-paper-leak-bihar-polices-eou-look-out-10-mbbs-students-medical-colleges-bihar-jharkhand",
    "title": "NEET-UG 2024 Paper Leak: Bihar Police's EOU Hunts for 10 MBBS Students in Bihar & Jharkhand",
    "published_date": "2024-06-24T03:30:00.000Z",
    "author_name": "Ramashankar",
    "author_url": "https://www.edexlive.com/author/ramashankar",
    "article_content": "More than 10 MBBS students of the government medical colleges in Bihar and Jharkhand are under the scrutiny of Bihar police's Economic Offences Unit (EOU) for their alleged involvement in the National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) 2024 question paper leak case. These students were associated with an inter-state 'solver gang' led by Sanjeev Mukhiya alias Lutan, a resident of Nagarnausa in Nalanda district. They are learnt to be beneficiaries of the racket involved in leak of question paper for the medical entrance examination by the gang, stated a report by The New Indian Express . The list of the students has been prepared on the basis of information elicited from six members of the 'solver gang' arrested from Jharkhand. Raids were conducted in Ranchi and Hazaribagh by the EOU in search of the students, but they could not be arrested. Investigation carried out by EOU revealed that Sanjeev Mukhiya, the alleged kingpin of the gang, initially worked for an education mafia Ranjeet Don of Nalanda. Mukhiya's son Shiv is learnt to have done his MMBS from Patna Medical College and Hospital and is currently lodged in Beur central jail near Patna. Shiv is an accused in the leak of question paper of teachers' recruitment through Bihar Public Service Commission. Meanwhile, EOU has stumbled upon clinching evidence to corroborate leak of question paper of NEET-UG 2024, officials associated with the investigation revealed on Sunday, June 23. Baldev Kumar alias Chintu, one of the six members of 'solver gang' arrested from Jharkhand's Deoghar district on Friday night, June 21, told the interrogators that he had obtained PDF file of question papers and answer sheets from one Rocky of Ranchi ahead of the examination on May 5. Chintu further disclosed that he had received the question papers and answer sheets on his WhatsApp. The same were printed through Wi-Fi and provided to 35 candidates to memorise them at Learn and Play School located at Khemnichal in the state capital. During interrogation, Chintu, who is an active member of 'solver gang' led by Sanjeev Singh alias Sanjeev Mukhiya alias Lutan, told the interrogators that he obtained the questions and answer sheets of Biology first followed by Physics and Chemistry. At least 12 copies of question papers and answer sheets were printed to be distributed among candidates at Learn and Play School at Khemichak. Rocky, who runs a restaurant on Kadru Road under Chutia police station in Ranchi, knew from where the question papers and answer sheets were obtained. Rocky is stated to be a resident of Nawada district in Bihar. A team of EOU officials conducted raids on suspected hideouts of Rocky in Ranchi and Hazaribagh on Sunday, June 23, but he could not be arrested. Sources said that Chintu revealed that a few of the candidates had appeared at the Hazaribagh centre on May 5. Chintu was present at Khemnichak but managed to escape before the police conducted searches there. He destroyed SIM and mobile phone used in the crime at NIT Ghat in Patna before leaving for Deoghar in Jharkhand. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2023/May/10/manipur-violence-we-have-not-slept-for-last-several-days-sayevacuated-students-of-bihar-35133.html",
    "title": "Manipur Violence: We have not slept for last several days, say evacuated students of Bihar",
    "published_date": "2023-05-10T04:57:00.000Z",
    "author_name": "Ramashankar",
    "author_url": "https://www.edexlive.com/author/ramashankar",
    "article_content": "Altogether 163 students hailing from Bihar and Jharkhand were brought back to their home towns from trouble-torn Manipur by a special flight on Tuesday, May 9. The Bihar government had made arrangements for the safe return of these students, who remained stranded in ethnic violence-stuck state. The students who were enrolled in different universities of Manipur were all praises for Bihar Chief Minister Nitish Kumar, who took personal interest in the early rescue of stranded students from Bihar and Jharkhand. All 21 students from Jharkhand were provided with an air-conditioned bus for their travel from Patna. Number of parents had gathered outside the Patna airport for their wards, who virtually heaved a sigh of relief after meeting their parents and other members of their families. \"Thank God, we have finally reached our home town Patna safely,\" said one of the students soon after landing at Patna airport. Nitish Kumar, a student of the National Institute of Technology (NIT), said that he was frightened after violence erupted outside the institute's campus. \"We were told by the authority not to move outside. But we were aware of what was happening outside. All the inmates of the institute are safe,\" he told the media. Mayank Raj, a fourth-year BTech student of Imphal, Manipur, said that he heard bomb explosions and firing outside the campus. \"Students had to face problems after the mess of the institute was closed due to tense situation. Scarcity of water is another problem faced by the students riding there,\" he revealed. Madhu Kumari, a student of Imphal Central Agriculture University, said that the students were living under threat. \"We were very upset and wanted to return home as early as possible. Many students had requested the government to make arrangements for our rescue from the violence-stuck state,\" she said. She revealed that internet services have been disrupted. \"We somehow managed to call our parents and informed them about the situation. Our parents also took initiative on their part and persuaded the senior officials of state government for the rescue,\" she disclosed. Saifullah, a fourth-year student of NIT, Manipur, said that now the situation is under control. The Indian Army has taken command of the situation and they have succeeded to a great extent to bring the situation under control for the last two-three days. \"You can well imagine that we have not slept for the last several days,\" he remarked. The students said that around 300 students studying in various institutes of Manipur were stranded in different parts of that state. Sohail Ahmad, a first-year student of NIT, said that their second-semester examinations have been postponed due to violence. His elder brother Md Niyaz Ahmad said that Sohail will go to Manipur only if the situation turned normal. At least 60 people have been killed in the ethnic clashes in Manipur and over 1,500 houses burnt since violent protests began on May 3. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2023/Aug/23/in-a-first-bihar-govt-initiates-process-for-appointment-of-vcs-to-7-universities-37213.html",
    "title": "In a first, Bihar gov't initiates process for appointment of VCs to 7 universities",
    "published_date": "2023-08-23T05:20:00.000Z",
    "author_name": "Ramashankar",
    "author_url": "https://www.edexlive.com/author/ramashankar",
    "article_content": "For the first time, the Bihar government has initiated the process for the appointment of vice-chancellors of universities in the state. Earlier the appointments of vice-chancellors of universities were made by the office of governor-cum-chancellor of universities, stated a report in The New Indian Express . The state government has sought applications from prospective candidates for the posts of vice-chancellors in seven universities of the state. The candidates can apply for the posts through both online and offline systems up to September 13. The posts have been advertised at: 1) Patna University 2) JP University, Chapra 3) BRA Bihar University, Muzaffarpur 4) LN Mithila University, Darbhanga 5) Sanskrit University, Darbhanga 6) BN Mandal University, Madhepura 7) Aryabhatta University, Patna As per the state government's decision, appointments have to be made through a search committee set up by the state government. The candidates should be below the age of 67 years and have teaching experience of at least 10 years. On the contrary, the chancellor's office has already advertised the vacant posts and applications have been sought between August 24 and 27. The applications have been sought for posts of vice-chancellors in the same universities. The very first time \"This is for the first time in the history of state universities when appointments of the vice-chancellors will be done by the state government. The new development is the fallout of ongoing tussle between the state government and Raj Bhavan,\" a senior professor of Magadh University, Bodh Gaya, told The New Indian Express . He said the power is vested with the chancellor, who has been entrusted with the task of appointment of vice-chancellors of universities. \"This precedent has been going on for a long time. But for the first time, appointments will be done by the state government,\" said a retired teacher of LN Mithila University, Prof Bashishtha Singh. The discord escalates The tussle between the state government and Raj Bhavan intensified after the latter stayed the order of the state education department to cease operations of three bank accounts of BRA Bihar University, Muzaffarpur. The Raj Bhavan expressed its displeasure over the manner operation of the bank accounts of the university was stopped by the state education department's additional chief secretary KK Pathak. Pathak had also halted the payment of salaries of vice-chancellors of the university concerned. The relations between the state government and Raj Bhavan were strained when the Bihar government's economic offence unit initiated a probe into the misappropriation of funds by the then vice-chancellor of Magadh University, Bodh Gaya. Vice-Chancellor Rajendra Prasad was accused of siphoning funds worth Rs 30 crore. Later searches were conducted at his office in Bodh Gaya and residences in Uttar Pradesh. Subsequently, he was placed under suspension. On Sunday, a senior Janata Dal (United) (JD (U)) minister Ashok Choudhary said, \"If universities can't adhere to guidelines of state government, they should manage funds to run the universities as well.\" © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2023/Aug/31/teachers-opposition-slam-bihar-for-slashing-govt-school-holidays-from-23-to-11-37380.html",
    "title": "Teachers, opposition slam Bihar for slashing gov't school holidays from 23 to 11",
    "published_date": "2023-08-31T11:52:00.000Z",
    "author_name": "Ramashankar",
    "author_url": "https://www.edexlive.com/author/ramashankar",
    "article_content": "Bihar government's decision to reduce the number of holidays, especially during the festive season, in the government-run schools in the state has triggered a controversy with the main opposition BJP and different teachers' organisations raising their objections and demanding immediate withdrawal of the order, stated a report in The New Indian Express . What does the notification say? State Education Department issued a notification late on Tuesday, August 29, reducing the number of holidays in government-run schools to 11 from 23, between September and December. The notification said that the directive has been issued under provisions of the Right to Education Act, 2009. The letter issued by director, higher education, however, said the move aimed at providing quality education to children enrolled in government schools. Which holidays have been slashed? The holidays for Raksha Bandhan, Teej, Juitiya, Vishwakarma Puja, Janmashtami and Guru Nanak Jayanti have been cancelled. For Durga Puja, holidays for six days have been slashed to three days only. Surprisingly, Sundays have been counted as holidays. Opposition slams move Taking serious note of the state government's directive to reduce the number of holidays during the festive season, Union Minister and Senior BJP leader Giriraj Singh said that holidays of festivals of Hindus have been cancelled by the state education department. \"Some days it is possible that Sariya will be implemented in Bihar,\" he tweeted. He alleged that it was an attempt by the Bihar government to impose a ban on festivals of Hindus. Bihar BJP Chief Samrat Choudhary, however, termed the decision 'politics of appeasement'. \"Both Chief Minister Nitish Kumar and RJD Chief Lalu Prasad are engaged in politics of appeasement,\" he added. State defends move RJD, however, defended the government's decision. \"There is no reason to make a hue and cry. The motive is to improve the quality of education in government schools. There is no politics in it at all,\" RJD spokesperson Mritunjay Tiwari said. The education department's notification clarified that it is necessary to have at least 200 working days in primary schools and 220 days in middle schools but due to elections, examinations, natural calamities and festivals studies are adversely affected in schools. It also said that there was no uniformity in schools so far as holidays are concerned. There have been instances when schools remained closed in a few districts whereas in other districts, schools remained open on the same days. Meanwhile, different teachers' organisations have sought the intervention of Chief Minister Nitish Kumar and Deputy Chief Minister Tejashwi Prasad Yadav to look into the grievances of teachers. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/breaking/2024/Jun/22/nta-director-general-subodh-kumar-singh-sacked-meet-the-new-dg",
    "title": "Subodh Kumar Singh SACKED as NTA Director General | Pradeep Singh Kharola takes charge",
    "published_date": "2024-06-22T17:52:02.701Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "Facing severe backlash from several corners, owing to mismanagement of exams like the National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) and the University Grants Commission - National Eligibility Test (UGC-NET), the Centre has removed Subodh Kumar Singh, Director General of the National Testing Agency (NTA). This was informed by the Ministry of Personnel via a statement today, Saturday, June 22. Retired Indian Administration Service (IAS) officer Pradeep Singh Kharola has been given additional charge as the Director General of the NTA \"till the appointment of a regular incumbent or until further orders\". Kharola is Chairman and Managing Editor of the India Trade Promotion Organisation, as stated in a report by NDTV . It maybe noted that this announcement comes hours before the re-test for those candidates who were given grace marks in the NEET UG exam. Also, The NEET Postgraduate (PG) exam has been postponed, it was announced today, June 22, late in the evening. Also, the details of the high-level committee which is to restructure the exam conducting process was announced today, June 22. Several protests had demanded the resignation of Subodh Kumar Singh, among re-exam and other such demands. Petitions have also been filed in the Supreme Court, which the apex court is in the process of hearing. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/breaking/2024/Jun/22/neet-ug-irregularities-matter-handed-over-to-cbi-ministry-of-education",
    "title": "NEET UG irregularities handed to CBI by Ministry of Education: Latest Updates",
    "published_date": "2024-06-22T18:45:50.633Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "As the clamour around allegations of paper leaks in the National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) refuses to die down, it was announced by the Ministry of Education, via a press statement shared through the Press Information Bureau of India (PIB), that the ministry has decided to hand over the matter to Central Bureau of Investigation (CBI). The statement was released today, June 22. \"Certain cases of alleged irregularities / cheating / impersonation / malpractices have been reported\", the statement said. \"For transparency on the conduct of the examination process, the Ministry of Education, Government of India after a review has decided to entrust the matter to the Central Bureau of Investigation (CBI) for comprehensive investigation\", the press statement informed. It also went on to remind that the Central government has enacted the Public Examination (Prevention of Unfair Means) Act, 2024 \"to prevent unfair means in the public examinations and to provide for matter connected therewith or incidental thereto\". \"Government is committed to ensure the sanctity of examinations and protect the interest of students. It is reiterated that any individual/ organization found to be involved will face strictest action\", the statement announced. This announcement comes after the news that the NEET Postgraduate (PG) has been postponed. It may be recalled that the Economic Offences Unit (EOU) of the Bihar Police was looking into the NEET UG paper leak allegations in Bihar. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/breaking/2024/Mar/14/nmc-norms-flouted-as-msc-faculty-deployed-as-examiners-for-mbbs-exams",
    "title": "NMC Norms Flouted: MSc Faculty Deployed as Examiners for MBBS Exams",
    "published_date": "2024-03-14T05:19:59.123Z",
    "author_name": "Aarti Kashyap",
    "author_url": "https://www.edexlive.com/author/aarti-kashyap",
    "article_content": "In contravention to norms of the National Medical Commission (NMC), many government medical colleges (GMC) in Telangana have allotted MSc and MSc PhD faculty as internal and external examiners for the MBBS practical examinations conducted in the colleges under the Kaloji Narayana Rao University of Health Sciences (KNRUHS), stated a The New Indian Express report. As per the NMC norms, the examiners for the internal and external practical MBBS examinations must have at least four years of teaching experience after a postgraduate degree following MBBS. Therefore, faculty members who have only completed an MSc or MSc PhD are not eligible. The university had also issued the same directions in this regard to the colleges. However, owing to a lack of qualified members in various colleges across the state, many MSc faculty have been allotted for the MBBS practical exams, according to sources. An assistant professor at the Suryapet Government Medical College told The New Indian Express , “The norms, changed a few years ago, disallows MSc faculty from being examiners. However, the practice continues in the government medical colleges. It needs to be corrected and only the eligible faculty should be deployed as examiners.” Irregular recruitment While every GMC in the state has been reeling from a shortage in staff, the issue is more deep-rooted than that. Doctors said that most of the recruitment in the GMCs was on a contract basis for a year, while the recruitment of regular teaching staff was not done regularly. Elaborating on the issue, a doctor from Nalgonda GMC explained, \"New government medical colleges are coming up in the state without the required infrastructure, teaching faculty and staff. Some colleges have only one or two teaching staff members. Meanwhile, the government is reluctant to fill vacancies regularly due to lack of funding. Contractual hiring fails to address the issue of understaffed GMCs, as these staff members serve for only one year and many are hesitant to join due to various restrictions, including limitations on private practice and lack of travel allowances for remote postings. Moreover, the significant disparity in remuneration between contractual and regular faculty members exacerbates the challenges faced by the latter.\" He pointed out that while a faculty member under contract gets Rs 1.25 lakh per month, the regular faculty gets Rs 85,000 for the same designation. Regularise services, demand doctors Doctors and professors are advocating for the regularisation of contractual hiring as the most viable solution to address the understaffed GMCs and prevent ineligible faculty from being deployed as examiners. Speaking to The New Indian Express , Telangana State Medical Council Vice-Chairman Dr Gundagani Srinivas said, \"We have been demanding the government to make all the faculty positions permanent. We had also urged that they be paid on par with the doctors at NIMS and AIIMS. We also gave representations multiple times over the same. Less salary is a major issue behind doctors preferring to join private hospitals over government ones. We also want the government to allow the doctors to carry on the private practice outside the official working hours of 9 am to 4 pm.\" Dr Srinivas added that the government's latest decision to hire 4,356 new teaching faculty in the colleges was just another temporary fix and that only by making these staff permanent can the issue of under-staffed colleges be resolved. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Apr/26/inter-results-declaration-and-student-suicides-what-we-should-be-doing-and-what-we-shouldnt-do",
    "title": "Inter Results Declaration and Student Suicides: Understanding the Mental Well-being of Students",
    "published_date": "2024-04-26T05:21:22.995Z",
    "author_name": "Aarti Kashyap",
    "author_url": "https://www.edexlive.com/author/aarti-kashyap",
    "article_content": "In less than 24 hours of the results of Intermediate public examination being announced, at least six students died by suicide, leaving their families mourning. The series of suicides have led to questions regarding the mental well-being and the pressure that students go through during and after examinations, stated a report by The New Indian Express . The desire to score the highest is driven by peer, family and societal pressures and raises expectations. Failure to meet these expectations is one of the major causes of youngsters taking the extreme step of ending their life. Senior child psychologist Dr Jawaharlal Nehru P told The New Indian Express : \"Any suicide involves two stages — incident and mental stage. It is not an instantaneous step, but the culmination of the a combination of various factors that youngsters experience, which leads to a suicidal ideation and the action. One must understand that children in the 14-16 age group undergo many physiological changes while they are still in school, where the environment is different than that in the college. As a student transitions to college life, they lose old friends, their actions are limited to studies and the college environment is also different from that of the school. All these factors affect a student who is very likely to experience a trauma, which they do not share with anyone and gradually isolate themselves. As they are not exposed to CASH — caring and sharing in college life — they become more reserved and prone to psychological distress\". Dr Nehru added that parents and teachers must stop inducing guilt in students if they do not perform well in exams, and must explain the necessity of learning rather than scoring marks. “The primary concern of most of the students who fail in an exam is how they will explain it to their parents. This shows that a lack of emotional standard from the parents pushes the children towards depression and isolation. An open communication with their children and regular interaction with teachers for supporting their children in studies can bring a tangible change in the grim scenario,” the psychologist said. Tele-Manas, a helpline, gets a number of distress calls from students and parents experiencing anxiety related to the results. One of the counsellors at Tele-Manas said, \"We have been receiving many distress calls since yesterday. Most of them are from students while a few parents are also calling us seeking help for their children. Whenever a student calls, they are under extreme pressure and stress and they have no safe place to express themselves. Our counselling calls give them the scope to open up, where we make them feel safe and encourage them towards being more positive and hopeful as one result is not worth the life of an individual. More importantly, family members and close ones also need to be more supportive of those who perform poorly in any examination\". K Rebecca Maria from 1-Life, a suicide prevention organisation, said that they had started receiving calls from students for help and a few of them were extremely stressed due to the bad results. She also explained that expectations from parents were one of the prime reasons for youngsters deciding to take steps for self-harm. “Any individual takes the step of suicide when they see no hope. As the students experience negativity, which pushes them into depression and loneliness and eventually leads to suicide, creating a positive atmosphere around them becomes crucial in such sensitive times. At the same time, we cannot overlook the cut-throat competition, hefty expenses and investment in education which burdens the parents, as well as the unrealistic success scenario that the society tries to impose on students and their parents, collectively contribute to students' suicide. What is more important for parents is to invest wisely and also encourage their children to follow their dreams, which can take off the burden that the children face,\" Maria said. Experts underline self-care in the form of mindfulness, exercise, yoga, meditation, journal writing, developing hobbies as some of the ways for one's emotional and mental well-being. They also stressed the role of support from the family and society for a healthy environment for children. 24/7 Suicide Prevetion Helplines: Tele-Manas - 14416 1Life - 9152987821 AASRA - 9820466726 Vandrevala Foundation - 9999666555 © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/campus/2024/May/01/osmania-university-water-crisis-issue-turns-political-congress-brs-play-blame-game",
    "title": "Osmania University Water Crisis: Political Blame Game Escalates as Congress and BRS Clash",
    "published_date": "2024-05-01T04:00:00.000Z",
    "author_name": "Aarti Kashyap",
    "author_url": "https://www.edexlive.com/author/aarti-kashyap",
    "article_content": "The war of words over the Osmania University (OU) amenities issue escalated on Monday, April 29, as Chief Minister Revanth Reddy and the opposition BRS party engaged in a blame game, holding the other accountable for the sorry state of OU. A day after former chief minister and Bharat Rashtra Samithi (BRS) President K Chandrasekhar Rao blamed the Congress government for failing to provide water and power to the university, CM Revanth slammed the Opposition for spreading false information. The notice The CM took to social media platform X to post an earlier notice by the chief warden on summer vacation in OU dated May 12, 2023, which said that there was an acute shortage of water and electricity in the university hostels and messes. Commenting on the notice, Revanth said, \"Even in May 2023 when KCR was the CM, the chief warden of the university issued a similar notice regarding the closure of hostels and messes for a month in connection with summer vacations. ( dated 12-05-2023 to 05-06-2023). It also mentioned the shortage of electricity and water.\" He said that KCR spreading the word that the university will close under the Congress rule was the zenith of his depravity. Responding to the tweet made by the CM, the BRS party took to its official X handle claiming that the CM had posted a fake letter of the chief warden and that he should rather provide water and power facilities to the students, instead of making fake claims on social media. BRS also shared another letter of the chief warden dated May 12, 2023, which did not mention any water or power issues and claimed it to be the original letter. The post was also retweeted by BRS working president KT Rama Rao. The issue turned intense when BRS member Krishank Manne also took to X saying that the CM had tweeted a fake letter from the previous year. The chief warden later wrote to the police department to take action against Krishank for circulating fake messages on social media about the closure of the university hostels and messes. In response, OU city police station filed a FIR against Krishank on forgery charges. Students say... While students said that the shortage of power and water supply has been a regular issue over the years, they have been receiving similar notices for closure of hostels and messes during the summer vacations, adding to their difficulties as they struggled to stay back in the campus for preparations of competitive exams and that the administration should address their grievances. As the drama unfolded through the day, V Narasimha, OU student leader, blamed the previous BRS government for the poor condition of the university campus and said that the KCR government has neglected the university for years altogether. Narasimha thanked the chief minister and the deputy chief minister and said that they had shown empathy towards the student's hardships and were supporting the university and the students in every possible way. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/24/neet-ug-row-over-40-petitions-filed-in-supreme-court-latest-one-seeks-cbi-ed-probe",
    "title": "Supreme Court receives over 40 petitions on NEET UG irregularities, latest plea seeks CBI & ED probe",
    "published_date": "2024-06-24T04:30:00.000Z",
    "author_name": "Suchitra Kalyan Mohanty",
    "author_url": "https://www.edexlive.com/author/suchitra-kalyan-mohanty",
    "article_content": "A fresh petition was filed, by a group of ten students who had appeared for the exam, in the Supreme Court seeking directions to the Central Bureau of Investigation (CBI) and the Enforcement Directorate (ED) to investigate into the alleged irregularities in the medical entrance exam the National Eligibility-cum-Entrance Test - Undergraduate (NEET-UG) held on May 5. The petition, filed by the group of 10 students, has also sought a direction from the top court to the Bihar Police to expedite the investigation in the case and file a report before it, stated a report by The New Indian Express . \"The petitioners are fully aware of the ramifications of the cancellation of the examination but there is absolutely no other alternative,\" the plea filed before the apex court said. On June 22, the Supreme Court refused to defer the counselling date, which is to kickstart on July 6, of the NEET-UG 2024 examination, after noting that it is not an \"open and shut\" process. It said so, after hearing a batch of pleas. The apex court issued notices to the National Testing Agency (NTA), Centre and others and sought their respective replies after hearing the petitions seeking cancellation of the exam over the alleged irregularities in holding it on May 5. A two-judge vacation bench of the top court, led by Justice Vikram Nath and Justice SVN Bhatti was hearing on Friday three pleas with respect to the alleged irregularities in the NEET UG exam. The three pleas were filed by three different individuals — Hiiten Singh Kashyap, Floral Vyas and Sunil Jain — seking CBI investigation into the alleged paper leak, cancellation of NEET-UG 2024 exam and counselling and similar other prayer respectively. Students and various educational institutions had moved the Supreme Court and various state high courts after the prestigious NEET-UG examination mired into alleged paper leak, irregularities, malpractices and others seeking various directions and orders to NTA. The top court on June 20 also, in another development, stayed the proceedings on the batch of pleas filed before various state high courts in the same issue, after hearing the plea filed by the NTA and issued notice on the agency's plea in connection with this year's National Eligibility-cum- Entrance Test (NEET) exam. All the pleas had been tagged along with the pending pleas already filed before it for further hearing to July 8, when the SC would be open, over almost 45 days off, after summer vacations. There are more than 40 petitions, including a fresh petition filed by a group of 20 students, who had appeared in the medical entrance exam, in the Supreme Court, seeking a direction for scrapping of the NEET-UG 2024 exam and an apex court-monitored probe by the CBI (Central Bureau of Investigation) or any other independent agency into the alleged irregularities in the test held on May 5. Recently, the NTA had told the apex court that score-cards of 1563 candidates who \"got grace marks\" in the NEET-UG 2024, will be cancelled and the students will have the option to reappear for the exam. The NTA had also further elaborated to the apex court that a committee has been constituted to review the results of over these 1,563 candidates who were awarded \"grace marks\" to compensate for the loss of time suffered while appearing for the exam. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/May/23/ex-state-pharmacy-council-registrar-issued-certificates-ineligible-candidates",
    "title": "Former Telangana Pharmacy Council registrar accused of issuing registration certificates to ineligible candidates, students allege",
    "published_date": "2024-05-23T05:00:00.000Z",
    "author_name": "Aarti Kashyap",
    "author_url": "https://www.edexlive.com/author/aarti-kashyap",
    "article_content": "Allegations of issuance of pharmacy registration certificates to ineligible candidates have surfaced against the former registrar of Telangana Pharmacy Council – G Ramdhan. Students have alleged that registration certificates were issued by the former registrar during the academic year 2021-2022 even to those who had failed in a two-year diploma course in pharmacy, stated a report by The New Indian Express . In one such instance, a person who had failed in one subject of part 2 of the diploma received the certificate of Registered Pharmacist by the council in the year 2022. As per Chapter 1 of Education Regulations, 2020, for diploma course in pharmacy issued in the gazette regulation of the Pharmacy Council of India, “The minimum qualification for registration as a pharmacist shall be a pass in Diploma in Pharmacy (Part I and part II) and satisfaction completion of Diploma in Pharmacy (Part III).\" Further, Chapter 2 states that the minimum criteria for passing the examination is to secure at least 40% marks in each of the subjects in the theory as well as the practical examination, including the sessional marks for the two-year diploma course. These regulations were formulated under Section 10 of the Pharmacy Act, 1948, for the course. However, registration certificates were issued to candidates who had failed in some of the subjects, and were therefore ineligible for getting registered as pharmacists. A Sanjay Reddy, former president of the council, speaking to the The New Indian Express , said, “Issuing certificates to candidates who have failed the examination is a violation of the Pharmacy Act, 1948. As per our knowledge, hundreds of students who failed the examination were issued the registration certificates under the former registrar. Students and pharmacy faculty members are also concerned regarding the certificates who failed the diploma course. We are requesting the government to take strict actions against those involved in issuing these certificates\". It is to be noted that the official is at present the deputy director of the Drug Control Administration (DCA). On being contacted by the The New Indian Express , the concerned official said that he had signed the registration certificates but was not fully aware of the circumstances under which the documents were approved by him. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/17/jntu-hyderabad-warns-students-of-action-over-staging-unreasonable-protests",
    "title": "JNTU Hyderabad Issues Warning to Students Over Unreasonable Protests",
    "published_date": "2024-06-17T05:50:00.000Z",
    "author_name": "Aarti Kashyap",
    "author_url": "https://www.edexlive.com/author/aarti-kashyap",
    "article_content": "The Jawaharlal Nehru Technological University, Hyderabad (JNTU-H) has taken cognisance of the constant discord between the university colleges and students over a range of issues, including the academic and hostel facilities. In a notice issued to the principals of JNTUH colleges by the registrar on Saturday, June 15, the university advised the college principals to attend to the issues related to students \"from time to time and address issues immediately which can be resolved with minimum care without any delay\". The circular also instructed the students to submit a representation to the respective college principals related to the academic and hostel issues. Further, warning of a strict action against students for resorting to agitation or protest over any given issue, the circular said that the students must allow a feasible time for a given issue to be resolved. \"Students are advised not to take any agitation/rally instantly, which causes disturbance to the healthy academic environment in the campus. If any such incidents take place hereafter in the campus, it will be reviewed seriously, which will come under the undisciplined attitude of the students,\" the circular said. A senior JNTUH official speaking to The New Indian Express said, \"We have been facing the challenge of students taking to protests over even minor issues without allowing time for the college administration to address the issue. This has been disturbing the academic environment in the campuses and affecting other students as well who are nowhere involved. We are very much willing to resolve the issues of the students but we want the students to maintain discipline and decorum in the institutions and not take to agitation even over slightest of the issues.\" The notice further stressed that if the issues were not resolved at the unit or college level, students can submit a copy of the representation to the registrar for necessary action, and that any academic matters related to the issues should be submitted through respective Head of Departments (HoDs) whereas the hostel related issues to be submitted through warden of the respective hostels. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/breaking/2024/Jun/24/uoh-fest-protests-five-including-student-union-president-suspended",
    "title": "University of Hyderabad fest protests: 5, including student union president, suspended",
    "published_date": "2024-06-24T01:57:44.763Z",
    "author_name": "Aarti Kashyap",
    "author_url": "https://www.edexlive.com/author/aarti-kashyap",
    "article_content": "The row over the cultural festival of the University of Hyderabad (UoH), Sukoon, has taken an ugly turn with the suspension of five students, who were involved in the protest at the residence of the vice-chancellor, Prof BJ Rao, on May 18. The university, in its order dated May 31, suspended Students Union President Ateeq Ahmed as well as other students, Kripa Maria George, G Mohith, Sohal Ahamed and Asika VM for one semester (July-December 2024), from the university campus and also expelled them from the hostel campuses. Additionally, Rs 10,000 was imposed on five more students as a part of the disciplinary action. The order said that the students had trespassed and attacked the vice-chancellor's residence, therefore leading to disciplinary action against them. Members of the students union condemned the administration for this action and have called on a sit-in protest from tomorrow onwards, demanding to revoke the suspension and fine on the students. One of the members of the students union told The New Indian Express that efforts were made for deliberations and talks on the issue to revoke the suspension since the release of the order, and a representation was also given to the deputy chief minister in this regard. However, the administration did not budge and that were now resorting to protests, demanding revoking of the orders. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/23/indian-students-canada-struggling-find-jobs-video-queue-tim-horton-goes-viral-2",
    "title": "Indian Students in Canada Struggle to Find Jobs: Viral Video Shows Long Queue at Tim Hortons",
    "published_date": "2024-06-23T03:30:00.000Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "Indian students were found queuing up outside an outlet of coffeehouse Tim Hortons in Canada. This happened because they found out that there was a job fair and they wanted to apply for the same. This news went viral after video content creator and student at York University, Toronto, Nishant shared an engaging Instagram Reel about the same. Though the reel was posted on his IG handle @heyiamnishat on June 12, it started getting picked up in the last few days. The student has been looking for part-time work for the last six months, just like many other students. The predicament of Indian students in Canada has been apparent, especially with the high cost of living and lack of jobs, as stated in a report by Hindustan Times . The video of a long queue outside Tim Horton's made by Indian students in hopes of bagging a job is heart-rendering. A post shared by Edex Live (@edexliveinsta) In May 2024, reports came out that Indian students were living in 'unsuitable housing' in Canada. This was stated by the latest census data from Statistics Canada. It indicated that in the year 2021, international students generally faced a higher likelihood of living in unsuitable housing than their Canadian-born peers. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/24/telangana-junior-doctors-launch-strike-demanding-timely-stipend-disbursement",
    "title": "Telangana junior doctors launch strike demanding timely stipend disbursement",
    "published_date": "2024-06-24T04:45:34.341Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "In a fight for their long-pending demands, Telangana junior doctors began an indefinite strike today, Monday, June 24, 2024. According to The New Indian Express, around 6,000 junior doctors from 26 medical colleges across Telangana will participate in the indefinite strike alleging the state government's inertness on their long-pending demands such as green channel for timely disbursement of stipends to junior doctors, house surgeons and others. Due to their strike, the junior doctors will be boycotting outpatient (OP) services, elective surgeries and ward duties. The strike by junior doctors began today and is scheduled from 9 am to 4 pm, with sloganeering during OP hours (9 am to 12 pm). On June 18, the Telangana Junior Doctors Association (T-JUDA) submitted a letter to the director of medical education (DME), listing their demands and intimating the DME about a strike from today, June 24, in case the authorities failed to take tangible action. In response to the doctors’ demands, the finance department on Saturday, June 22, issued orders to the DME to release funds worth Rs 123.32 crore for 2024–25. However, the doctors said that allocating an annual budget was not enough and that the funds should also be released to them on time. They noted that similar amounts had been sanctioned every quarter earlier as well but there were delays in disbursing the stipends. Additionally, the Telangana Junior Doctors Association (T-JUDA) also wanted contractual assistant positions with a salary of Rs 1,25,000 for doctors who have completed super-specialty courses. Speaking to TNIE, Dr CH G Sai Sri Harsha, T-JUDA president, said, “The finance department should clear all obstacles in releasing stipends to resident doctors by creating a green channel. It should also issue a circular stating stipends will be credited before the 10th of every month to all junior doctors.” Further, Dr Harsha recalled that previous representations to the health minister and the deputy chief minister had not yielded results and that the doctors were forced to call a strike. Plan B for patients The strike would put pressure on outpatient and other services in government medical colleges. Dr B Nagendar, superintendent of Osmania General Hospital told TNIE that while junior doctors were going on elective work strike, they would still be on emergency duty. “Faculty members will look after operation theatres, ward rooms and OP. We have instructed the HoDs (Head if Departments) of all departments to arrange for faculty members to ensure health services are not affected,” he said. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/24/neet-ug-paper-leak-case-cbi-team-to-visit-patna-may-take-alleged-accused-to-delhi-for-questioning",
    "title": "CBI to Investigate NEET-UG Paper Leak; Accused to be Questioned in Delhi",
    "published_date": "2024-06-24T05:15:00.000Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "The Economic Offences Unit (EOU) of the Bihar Police said that a Central Bureau of Investigation (CBI) team is expected to visit Patna today, June 24, 2024. Additionally, it may take those arrested in the National Eligibility cum Entrance Test for Undergraduate (NEET-UG) paper leak case to Delhi for questioning. So far, they have arrested 18 people in connection with the case. CBI officers are likely to collect evidence related to the case from the EOU, which had been investigating the matter until the Centre ordered a probe by the federal agency, they added, as stated in a report by PTI. On Sunday, June 23, the CBI filed an FIR in connection with alleged irregularities in the medical entrance exam NEET-UG, which was held on May 5, on a reference from the Education Ministry, amid countrywide protests and litigations by students for a probe into the allegations of paper leak. \"The CBI team is expected to visit the EOU office around 11.30 am and collect all evidence, including the pieces of the burnt question paper that was recovered from a house in Patna, mobile phones of those arrested, SIM cards, laptops, post-dated cheques and reference questions papers provided by the National Testing Agency (NTA),\" an EOU officer said. \"All those arrested are in judicial custody in Patna, and the CBI team may take them to Delhi for detailed interrogation by obtaining transit remand from a court here,\" the officer added. Further, the officer added that the CBI may file multiple FIRs in connection with the matter to probe the destruction of evidence and also register disproportionate assets (DA) cases against some of those accused who are public servants, he said. \"A DA case may be registered against arrested accused Sikander Prasad Yadvendu, a junior engineer in Danapur Town Council, as he reportedly acquired huge assets that are disproportionate to his known source of income,\" the officer said. Yadvendu, originally from Samastipur, has been identified as the prime suspect in the case, he said. \"He has a history of involvement in criminal activities. Before becoming a junior engineer in 2012, he worked as a contractor in Ranchi. He was previously implicated in an LED scam worth Rs 3 crore. He has served a jail sentence for his role in that case,\" the officer said. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/24/congress-mp-parambil-slams-neet-pg-postponement-saying-lkg-exams-have-more-credibility-than-this",
    "title": "Congress MP Shafi Parambil slams NEET PG postponement, questions government's credibility",
    "published_date": "2024-06-24T05:58:24.550Z",
    "author_name": "Edexlive Desk",
    "author_url": "https://www.edexlive.com/author/edexlive-desk",
    "article_content": "The National Eligibility cum Entrance Test Postgraduate (NEET PG) Examination was postponed hours before it was scheduled to be conducted on June 23. Slamming the postponement saying \"LKG exams have more credibility than this...\", Congress Member of the Parliament (MP) Shafi Parambil said that the government has committed a heinous crime. Speaking to ANI, he said, \"Even the LKG exams have more credibility than this. The government's involvement in this is not at all neat and clean... This is the most heinous crime a government can do against the future of a country... This is done on the basis of merit. You cannot leak these question papers because those people who come out of these exams are considered to be our future doctors and engineers.\" Questioning Prime Minister Narendra Modi on being silent on this issue, he said, \"The minister is not taking responsibility. Nobody is stepping down. They are just watching the game from the gallery. Even the enquiry is declared now because of the pressure from the families and the political parties...\" \"The government wants nothing to come out of this... Who is responsible for this?... Why is the PM still silent on this?... Why is the PM not acting promptly,\" he asked, as stated in a report by ANI. Postponement of NEET PG The Ministry of Health and Family Welfare postponed the NEET PG examination on Saturday, June 22 which was scheduled to be held on Sunday, June 23,and said that a fresh date will be announced at the earliest. This postponement of NEET-PG exams came on the heels of the decision to remove Subodh Kumar Singh from his position as Director-General of the National Testing Agency (NTA), which has come under fire for an alleged paper leak and irregularities in the NEET-UG examination, and other examinations which it conducts. The ministry's statement read, \"Taking into consideration, the recent incidents of allegations regarding the integrity of certain competitive examinations, the Ministry of Health has decided to undertake a thorough assessment of the robustness of the processes of the NEET-PG Entrance Examination, conducted by the National Board of Examination for medical students.\" \"It has accordingly been decided, as a precautionary measure, to postpone the NEET-PG Entrance Examination, scheduled to be held on 23rd June 2024. The fresh date of this examination will be notified at the earliest,\" the ministry added. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2023/Sep/13/bihar-school-girls-viral-video-school-took-more-admissions-than-it-seating-capacity-says-official-37602.html",
    "title": "Bihar school girls viral video: School took more admissions than it seating capacity, says official",
    "published_date": "2023-09-13T05:10:00.000Z",
    "author_name": "Ramashankar",
    "author_url": "https://www.edexlive.com/author/ramashankar",
    "article_content": "An education department official in Bihar had to bear the brunt of a group of girl students on Tuesday, September 12, for lack of seating arrangements in their school. The students created a ruckus and pelted the officer's car with stones as a mark of protest. The incident took place with the block education officer (BEO) Ahilya Kumar during the inspection of the Mahnar Girls High School in Vaishali district. The students initially complained about poor seating arrangements in classrooms. They alleged that while the attendance of students has increased due to strict instructions issued by the state education department's Additional Chief Secretary KK Pathak, there were no proper seating arrangements in classrooms. The school is learnt to have enrolled more students than its sitting capacity in the classrooms. Sources said that 75% of attendance in all government schools has been made mandatory for the students else their names would be deleted from their respective schools. Viral video The girls were agitated after they received no assurances from the officer in question. Subsequently, they vandalised the officer's car parked on the premises of the school. The officer, however, remained a mute spectator to the scene as the girls were in no mood to relent. \"We have been facing plenty of problems in the school. Nobody is ready to listen to our complaint,\" some of the protesting girls could be heard in a video that went viral on social media. \"How can we study properly in the absence of adequate number of benches and tables in the classrooms? Who is to blame for the poor sitting arrangements in classrooms? You people come for inspection and do nothing for the welfare of students,\" alleged some of the students. Road block The students also blocked the Mahnar-Mohiuddin Nagar road and disrupted vehicular traffic near Madan Chowk and Patel Chowk. The road blockade led to a heavy traffic jam on the busy road, leaving people stranded in the scorching sun. The police had to use mild force to restore traffic on the road. Students alleged that a woman police officer thrashed a few of their classmates during the process of removing the road blockade put up by students of the school. The school is located a stone's throw from the Mahnar-Mohiuddin Nagar road. \"The woman police officer assaulted some of our classmates. She misbehaved with students and also threatened to book us in a criminal case for causing hurdles in the discharge of official duty,\" the agitating girls alleged. When contacted for comments, Mahnar Sub-Divisional Officer (SDO) Neeraj Kumar said that the school had taken more admissions than its sitting capacity. \"The students who didn't find space to sit in the classroom protested and blocked the road,\" he told The New Indian Express over phone. The SDO said that for the time being, the school authorities have been asked to run the school in two shifts. In addition, a probe has been ordered into the entire incident, he added. © edexlive 2024"
},
{
    "article_url": "https://www.edexlive.com/news/2024/Jun/24/neet-paper-leak-17-students-bihar-debarred-leaked-question-papers-hazaribagh-jharkhand",
    "title": "NEET Paper Leak: Bihar Students Debarred, Question Papers from Hazaribagh",
    "published_date": "2024-06-24T02:29:21.604Z",
    "author_name": "Ramashankar",
    "author_url": "https://www.edexlive.com/author/ramashankar",
    "article_content": "Altogether 17 candidates who appeared for the National Eligibility-cum-Entrance Test Undergraduate (NEET-UG) examination from Bihar on May 5 have been debarred by National Testing Agency (NTA) following large-scale irregularities. The students had taken their examination at centres in Patna, stated a report by The New Indian Express . Nine of them were issued notices by the Bihar police's Economic Offences Unit (EOU) asking them to appear before the probe agency. However, two of them appeared before the EOU and the rest were yet to respond to the notices served on them. Earlier, two students were arrested by Patna police from their examination centres on the suspicion of being involved in question paper leak. Meanwhile, EOU, in a press statement issued on Sunday, June 23, claimed that the question papers were received by the accused at Learn and Play School that was used as 'safe house' by the accused. The EOU has found roll numbers of at least 15 students who were present at the Learn and Play School located at Khemnichak in the state capital. Four of them have so far been questioned. The investigation revealed that the question paper received by the accused came from Oasis School at Hazaribagh in Jharkhand. There is evidence of tampering in the packaging of the question paper, the investigating officials pointed out. The EOU team recorded the statements of those working in the State Bank of India, Hazaribagh and also Blue Dart courier services. © edexlive 2024"
}
]